{
  "backend/main.mo": "Main Motoko actor implementing a Bitcoin credit system with custodial wallet management, including balance tracking, BTC transfers, withdrawal requests, reserve management, multisig configuration, transaction status monitoring, mempool fee analysis, and role-based access control with admin authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including styling with OKLCH color system and lottery components, routing with authentication gates, React Query hooks for backend operations, layout components, authentication flows, dashboard pages, transfer management, and withdrawal functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication gate using Internet Identity, admin guard with cached status checks, profile setup modal for new users, automatic 500-credit assignment for verified admins, and route definitions including AI Lottery page.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Access denied screen component displaying principal ID with copy functionality, session diagnostics showing token detection and access control initialization status, and action buttons for retry, sign out, and navigation to home.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen component for admin verification with animated spinner, elapsed time counter, masked principal display, and recovery actions (retry/sign out) that appear after 10 seconds.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card when an authenticated user is not recognized as an admin, showing their principal ID with copy functionality and a retry button for re-checking admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Renders a centered sign-in panel for unauthenticated users with a button to initiate Internet Identity login.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a toggle button for signing in/out with Internet Identity, clearing query cache and admin status on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to complete profile setup, preventing dismissal until submitted.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays an estimated USD value for a given BTC amount based on current price, with loading states and disclaimer text.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with logo, navigation links (buy credits, send BTC, history, etc.), admin link for authorized users, mobile menu, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component wrapping the app with header, main content area with admin troubleshooting card, and footer with caffeine.ai attribution.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues, including API connectivity and fee-related problems.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Admin component that monitors and displays reserve status with polling, showing readiness indicators, coverage ratio, and manual refresh capability.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "A collapsible card component that displays a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that the script must be executed externally and includes copy-to-clipboard functionality.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "A collapsible card component showing a Python script for monitoring mining pool earnings and automating reserve transfers, with alerts emphasizing external execution requirements and security warnings about API keys.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "A form component for storing and viewing Bitcoin multisig configuration metadata (threshold, public keys, address, redeem script) with copy functionality and alerts clarifying it only stores reference data, not actual transaction signing.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "A collapsible card displaying Python code for creating Bitcoin Core multisig addresses externally, with warnings that the app cannot execute Python or connect to localhost Bitcoin Core RPC.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Defines a structured array of best practice entries for troubleshooting transfer issues, covering categories like connectivity (localhost restrictions), provider timeouts, mempool congestion, and network/address validation errors.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "A searchable troubleshooting guide component with category filtering, accordion-style entries, and auto-suggestion of relevant best practices based on failure reasons and diagnostic data.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "A collapsible informational alert component that explains how Bitcoin transaction broadcasting works in the app, emphasizing that private keys must never be stored and all signing must be done externally, while the app only broadcasts pre-signed transactions via IC HTTP outcalls to public blockchain APIs.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a table of transaction history with columns for type, date, reference, amount, and actions; supports auto-opening a verification dialog for a specific transaction and shows USD estimates using current BTC price data.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "A dialog component that displays detailed status information for a specific transfer request, including status badges, transaction IDs, auto-refresh functionality, and actions like copying txid, manual refresh, and troubleshooting navigation.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "An admin table component for managing withdrawal requests with tabs, status badges, and actions to mark requests as paid or reject them with a reason; includes principal ID copying and request sorting with PENDING requests prioritized.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Displays an admin overview dashboard showing counts of pending, paid, and rejected withdrawal requests with status cards and a call-to-action button to scroll to the inbox when pending requests exist.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "A collapsible developer reference component that displays code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts) with copy-to-clipboard functionality.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Renders a table of withdrawal requests sorted by timestamp (newest first) showing request ID, date, amount, payment method, and status with badges; displays an empty state when no requests exist.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "A card component that displays a summary grid of pending, paid, and rejected withdrawal counts with an informational alert explaining that 'Paid' status is an administrative record only, not an automatic transfer.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Hook that manages a boolean preference for AI reserve monitoring in localStorage, defaulting to true (enabled) and persisting changes automatically.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Hook that monitors withdrawal requests and displays a toast notification when a request transitions from PENDING to PAID, ensuring each notification is shown only once per request ID per principal using persistent storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profiles, Bitcoin wallet operations, credit purchases, transaction history, withdrawal requests, reserve management, and AI lottery functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes featuring warm charcoal backgrounds with amber accents, plus specialized lottery page gradient styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the app with InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin verification page displaying authenticated principal ID, current balance with USD estimate, and a list of admin capabilities including credit grants and reserve management.",
  "frontend/src/pages/AdminPage.tsx": "Comprehensive admin dashboard with tabs for sending BTC, managing reserve deposits/withdrawals, processing user withdrawal requests, monitoring reserve status, and configuring multisig settings with AI monitoring preferences.",
  "frontend/src/pages/AiLotteryPage.tsx": "React component for an AI-powered lottery number generator that attempts to fetch recent draw data from data.ny.gov, falls back to local data if unavailable, and generates 3 lottery outcomes mixing recent winners with random numbers.",
  "frontend/src/pages/BuyCreditsPage.tsx": "React component for purchasing Bitcoin credits by submitting a mainnet transaction ID and amount, displaying current balance with USD estimate and blockchain verification alerts.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user's BTC balance, recent transactions, Bitcoin wallet info, withdrawal status, and security notices about the app-managed custodial reserve model.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page showing all user transactions with summary statistics (total transactions, credits received, total spent) and a detailed transaction table component.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/SendBtcPage.tsx": "Bitcoin transfer page with form for destination address and amount, real-time network fee estimation, balance validation, and live polling of transfer request status during blockchain broadcasting.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Displays detailed troubleshooting information for Bitcoin transfer requests, including status analysis, blockchain confirmation checks, and options to retry failed broadcasts or refresh status.",
  "frontend/src/pages/WithdrawPage.tsx": "Provides a form for users to submit withdrawal requests to convert credits to external funds, displays withdrawal history, and shows funded withdrawal notifications with balance and USD value estimates.",
  "frontend/src/utils/adminStatusCache.ts": "Manages per-principal admin status caching in localStorage with 5-minute TTL and in-memory session tracking to ensure fresh verification checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes backend error messages into user-friendly text for Send BTC operations and reserve deposit validations, handling blockchain API errors, insufficient funds, and broadcast failures.",
  "frontend/src/utils/fundedNotificationStore.ts": "Manages per-principal localStorage tracking of which withdrawal request IDs have been announced as PAID to prevent duplicate notifications across sessions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, extended theme settings (fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking architectural decisions (custodial Bitcoin wallets, admin flows, BlockCypher API integration, Telegram bot), known issues (mobile login, on-chain broadcast failures, admin verification delays), and existing/planned features for a credit-based Bitcoin transaction system."
}