{
  "backend/main.mo": "Defines actor state, authorization mixin, and extensive types for BTC transfers, fees, reserve status, and diagnostics.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering styles, routing, hooks, components, and pages.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color tokens and global background/foreground behavior.",
  "frontend/index.html": "Minimal HTML shell mounting the React app with a root div and main script entry.",
  "frontend/src/App.tsx": "Sets up router, query client, auth gate, admin guard, and main application layout and routes.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI card explaining failed admin access with principal display, copy button, diagnostics, and navigation actions.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen for admin verification with elapsed timer, masked principal, and retry/sign-out options.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Shows a warning card for non-admin authenticated users with their principal ID and options to copy it or retry the admin check.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login and logout via Internet Identity, clearing caches and session parameters when signing out.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name to complete profile setup.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays a USD estimate for a BTC amount or a loading/unavailable state if price data is missing.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the main header with navigation, login controls, admin link logic, and user greeting based on profile data.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the overall app layout including header, admin troubleshooting banner, content area, and footer.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Defines structured best‑practice entries and text used for troubleshooting Bitcoin transfer issues.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "Provides searchable best-practices guidance with suggested topics, filtering, and expandable detailed entries.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Expandable note explaining how transaction broadcasting works and warning users not to enter private keys.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a sortable table of user transactions with type labels, date formatting, USD estimates, and a dialog for verifying transfer details.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Shows detailed status of a transfer request with live updates, copy-to-clipboard support, refresh controls, and troubleshooting navigation.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Renders an admin table for managing withdrawal requests, including marking paid, rejecting with reasons, and copying principal IDs.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Displays high‑level counts of pending, paid, and rejected withdrawal requests with summary cards and optional navigation to the inbox.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer note component showing PayPal and Stripe payout API examples with copy-to-clipboard actions.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Displays a sortable table of withdrawal requests with timestamps, amounts, methods, and status badges.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Summarizes counts of pending, paid, and rejected withdrawals and provides guidance on what the Paid status means.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Watches withdrawal status changes and triggers a toast when a request transitions to Paid, ensuring one notification per request.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for fetching and mutating user data, balances, Bitcoin transactions, and fees via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and custom theme variables, including light/dark palettes and component utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root App component.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Displays admin identity, balance info with USD estimate, and lists available admin capabilities.",
  "frontend/src/pages/AdminPage.tsx": "Implements the main admin dashboard for sending BTC, managing reserves, handling withdrawals, and viewing transactions.",
  "frontend/src/pages/AiLotteryPage.tsx": "Generates AI-assisted lottery outcomes using fallback data when live fetch fails, displaying results and errors.",
  "frontend/src/pages/BuyCreditsPage.tsx": "UI for submitting a Bitcoin txid and amount to purchase credits, showing current balance and USD estimate.",
  "frontend/src/pages/DashboardPage.tsx": "Main wallet overview showing balance, price estimate, recent transactions, wallet info, and security notices.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full transaction history with summaries of totals and an optional auto-open request ID.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Static page describing puzzle rewards, currently disabled and not implemented in backend.",
  "frontend/src/pages/SendBtcPage.tsx": "Form to send BTC credits with fee estimation, validation, and outcome alerts including navigation to details.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Troubleshooting view for a specific transfer request with status, analysis, refresh, and retry options.",
  "frontend/src/pages/WithdrawPage.tsx": "Withdrawal form page that submits payout requests, displays balance and USD estimates, and shows withdrawal history with notifications for funded requests.",
  "frontend/src/utils/adminStatusCache.ts": "Provides localStorage-backed caching of admin status per principal with TTL and in-memory tracking for current-page verification.",
  "frontend/src/utils/errors.ts": "Normalizes Send BTC backend errors into concise, user-friendly messages with specific handling for address, balance, and network issues.",
  "frontend/src/utils/fundedNotificationStore.ts": "Tracks which withdrawal requests have already triggered 'paid' notifications using per-principal localStorage state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage support and hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings for the frontend UI.",
  "project_state.json": "Project configuration snapshot describing app scope, architecture notes, known issues, and existing feature metadata."
}