{
  "backend/main.mo": "Main Motoko actor implementing a Bitcoin credit transfer system with custodial wallet management, BTC price tracking, reserve management, multisig configuration, transaction processing, withdrawal requests, access control via MixinAuthorization, and comprehensive state tracking for balances, transfers, and user profiles.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling with OKLCH color system, routing with TanStack Router, React Query hooks for backend operations, authentication flows, dashboard components, transfer management, withdrawal flows, and AI lottery feature.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard, buy credits, send BTC, history, admin, withdrawals, and AI lottery; includes AuthGate for authentication, AdminGuard for admin route protection with cache-aware admin status checking, ProfileSetupModal for first-time users, and automatic 500-credit assignment for verified admins.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial screen displaying principal ID with copy functionality, session diagnostics showing token and access control initialization status, and action buttons for retry, sign out, and navigation to home.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen for admin verification with animated spinner, elapsed time counter, masked principal display, and recovery actions (retry/sign out) that appear after 10 seconds if verification is still pending.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card for authenticated users who are not recognized as admins, showing their principal ID with copy functionality and a retry button for re-checking admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Renders a centered sign-in panel for unauthenticated users with a button to initiate Internet Identity login.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a toggle button for signing in/out with Internet Identity, clearing query cache and admin status on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to complete profile setup, preventing dismissal until submitted.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays an estimated USD value for a given BTC amount based on current BTC price, with loading states and disclaimer text.",
  "frontend/src/components/layout/AppHeader.tsx": "Main navigation header with logo, authenticated navigation links (buy credits, send BTC, history, etc.), admin link for authorized users, mobile menu, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component wrapping the app with header, main content area with admin troubleshooting card, and footer with caffeine.ai attribution.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues, including API connectivity and fee-related problems.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Admin component that displays real-time reserve status monitoring with readiness indicators, coverage ratio, and manual refresh capability with optional polling.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "A collapsible card component that displays a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that the script must be executed externally since the IC canister cannot run Python or connect to localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "A collapsible card component showing a Python script for monitoring mining pool earnings and automating reserve transfers, with alerts emphasizing external execution requirements and security warnings about API keys.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "A form component for storing and viewing multisig configuration metadata (threshold, pubkeys, address, redeem script) with copy functionality and alerts clarifying that actual multisig creation/signing must be done externally.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "A collapsible card displaying Python code for creating Bitcoin Core multisig addresses, with warnings that the code must be run externally and results should be saved in the app's configuration panel.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Defines a structured array of best practice entries for troubleshooting transfer issues, covering categories like connectivity (localhost limitations), provider timeouts, mempool congestion, and network/address format problems.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "A searchable troubleshooting guide component with category filtering, accordion-style entries, and auto-suggestion of relevant best practices based on transfer failure reasons and diagnostic data.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "A collapsible informational alert component that explains how Bitcoin transaction broadcasting works in the app, emphasizing that private keys must never be stored and all signing must be done externally, while the app only broadcasts pre-signed transactions via IC HTTP outcalls.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a table of transaction history with columns for type, date, reference, amount, and actions; supports auto-opening a verification dialog for a specific transaction and shows USD estimates using current BTC price.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "A dialog component that displays detailed transfer request status (IN_PROGRESS, VERIFIED, COMPLETED, FAILED, EVICTED) with auto-refresh capability, transaction ID copying, and navigation to troubleshooting page.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Admin table component for managing withdrawal requests with actions to mark as paid or reject with reason; includes tabs for filtering by status (pending/paid/rejected) and displays user principal IDs with copy functionality.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Displays an admin overview dashboard showing counts of pending, paid, and rejected withdrawal requests with status cards and a call-to-action button to scroll to the inbox when pending requests exist.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "A collapsible developer reference component that displays code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts) with copy-to-clipboard functionality.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Renders a table of withdrawal requests sorted by timestamp (newest first), displaying request ID, date, amount, payment method, and status badges with icons for pending/paid/rejected states.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "A card component showing a summary grid of pending, paid, and rejected withdrawal counts with an informational alert explaining that 'Paid' status is an administrative audit record only.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor instance with authentication via Internet Identity, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Hook that manages a boolean preference for AI reserve monitoring in localStorage, defaulting to true (enabled) and persisting changes across sessions.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Hook that monitors withdrawal requests and displays a toast notification when a request transitions from PENDING to PAID, ensuring each notification is shown only once per request ID per principal using persistent storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity management, and authentication state tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profiles, Bitcoin wallet operations, credit purchases, transaction history, withdrawal requests, reserve management, and BTC price data.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, featuring warm charcoal backgrounds with amber accents and specialized lottery page gradient styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin verification page displaying authenticated admin's principal ID, current BTC balance with USD estimate, and listing admin capabilities like credit grants and reserve management.",
  "frontend/src/pages/AdminPage.tsx": "Comprehensive admin dashboard with tabs for sending BTC, managing reserve deposits/withdrawals, validating transactions, monitoring withdrawal requests, and configuring multisig settings with real-time status tracking.",
  "frontend/src/pages/AiLotteryPage.tsx": "React page component that generates AI-powered lottery number predictions, attempting to fetch historical draw data from data.ny.gov with a fallback to simulated data, displaying three outcomes with confidence scores.",
  "frontend/src/pages/BuyCreditsPage.tsx": "React page component for purchasing BTC credits by submitting Bitcoin mainnet transaction IDs for verification, displaying current balance and USD estimates.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user's BTC balance, recent transactions, Bitcoin wallet info, withdrawal status, and security notices about the app-managed custodial reserve model.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page showing all user transactions with summary statistics (total transactions, credits received, total spent) and a detailed transaction table with optional initial request ID from session storage.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system feature that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/SendBtcPage.tsx": "React page for sending BTC with real-time network fee estimation, balance validation, and live transfer status polling that tracks broadcast progress from pending through completion or failure.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Displays detailed troubleshooting information for a Bitcoin transfer request, including status analysis, blockchain confirmation checks, and options to retry failed broadcasts or refresh status.",
  "frontend/src/pages/WithdrawPage.tsx": "Provides a form for users to submit withdrawal requests to convert credits to external funds, displays withdrawal history, and shows funded withdrawal notifications with balance and USD value estimates.",
  "frontend/src/utils/adminStatusCache.ts": "Manages per-principal admin status caching in localStorage with 5-minute TTL and in-memory session tracking to ensure fresh verification checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes backend error messages into user-friendly text for Send BTC operations and reserve deposit validations, handling address validation, insufficient funds, broadcast failures, and blockchain API errors.",
  "frontend/src/utils/fundedNotificationStore.ts": "Manages per-principal localStorage tracking of which withdrawal request IDs have been announced as PAID to prevent duplicate notifications across sessions.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, extended theme settings (fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (v125) describing a Bitcoin credit system with custodial wallets, admin functionality, Telegram bot integration, and numerous known issues related to on-chain broadcasting, mobile login, and address validation."
}