{
  "backend/main.mo": "Main canister defining user profiles, balances, BTC transfer requests, authorization checks, and wallet/transaction management with access‑controlled query and update methods.",
  "backend/migration.mo": "Migration module returning unchanged persistent actor state with fields for network fee and request counter.",
  "feature_evidence.json": "Feature evidence report linking a frontend transfer‑details enhancement to specific source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend files including layout, hooks, pages, and transfer‑related components.",
  "frontend/index.css": "Global Tailwind base layers defining light/dark theme color variables and applying layout‑wide background and border styles.",
  "frontend/index.html": "Root HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level React routing and auth‑gating logic with admin verification flow, profile setup, and initial admin credit assignment.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI screen showing admin‑access denial with principal display, diagnostics, copy and retry actions, and navigation controls.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen for admin verification showing masked principal, elapsed time, and retry/sign‑out actions after delay.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Shows a warning card for authenticated non-admin users with their principal ID and a retry admin check button.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides sign-in/out using Internet Identity and clears cached admin state on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name to complete profile setup.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with navigation, profile info, login button, and conditional admin link.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main layout with header, admin troubleshooting card, content area, and footer.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a table of transactions with type badges, timestamps, amounts, and a verify dialog trigger.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Dialog for verifying or confirming on-chain BTC transfers, showing status and allowing TXID input or copy.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data, wallet info, balances, admin status, and Bitcoin operations via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for light/dark themes along with reusable UI component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Renders an admin credentials overview showing principal, balance, and admin capabilities with navigation to the admin panel.",
  "frontend/src/pages/AdminPage.tsx": "Provides the admin panel UI for managing credits, sending BTC, viewing transactions, and validating principals.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Implements a UI for purchasing credit by submitting a Bitcoin transaction ID and amount, displaying balance and purchase status.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing balance, recent transactions, wallet info, and quick actions using query hooks.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full transaction history with credit/debit summaries and a detailed table.",
  "frontend/src/pages/SendBtcPage.tsx": "Form for sending BTC with balance display, fee estimation, validation, and transfer submission handling.",
  "frontend/src/utils/adminStatusCache.ts": "Manages per-principal admin status caching with TTL using localStorage and in-memory tracking.",
  "frontend/src/utils/errors.ts": "Normalizes backend Send BTC error messages into user-friendly text with special handling for broadcast issues.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters across navigation using URL and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors, typography, animations, and plugins for styling.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, known issues, and a list of implemented features with versioned IDs."
}