{
  "backend/main.mo": "Main actor implementing a Bitcoin credit transfer system with balance management, transaction tracking, withdrawal requests, peer transfers, access control, and Bitcoin price fetching via HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report documenting frontend error handling improvements for mainnet broadcasting failures, referencing SendBtcPage, error utilities, and related components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with details on routing, authentication, transaction handling, and admin features.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color tokens for light/dark modes, transaction status colors, and Segwit address styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component configuring React Router with routes for dashboard, buy credits, buy BTC, send BTC, history, admin pages, withdrawals, peer transfers, and authentication with QueryClient and ThemeProvider setup.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Access denied screen displaying principal ID with copy functionality, session diagnostics showing token and access control status, and retry/sign-out actions.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen for admin verification with elapsed time counter, masked principal display, and retry/sign-out actions appearing after 10 seconds.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protected route wrapper that checks admin status using useIsCallerAdmin hook and renders AdminAccessLoadingScreen or AdminAccessDeniedScreen when appropriate.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card for authenticated non-admin users, showing their principal ID with copy functionality and a retry button to re-check admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Renders a centered sign-in panel for unauthenticated users with a button to initiate Internet Identity login.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button that handles Internet Identity authentication, clears query cache and admin status on logout, and manages authentication state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays estimated USD value for a BTC amount with a disclaimer about market fluctuations, showing loading state or unavailable message when appropriate.",
  "frontend/src/components/buybtc/BuyBitcoinHistoryTable.tsx": "Table component displaying Bitcoin purchase history with transaction IDs, amounts, dates, and actions to copy txid or view on blockchain explorer.",
  "frontend/src/components/buybtc/InstantFundingForm.tsx": "Form for recording Bitcoin purchases by entering transaction ID and amount, with validation, instant balance crediting, and success feedback.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with title and login/logout button that manages Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component that renders the header, navigation menu with authenticated/admin-specific links (Dashboard, Buy BTC, Send BTC, Withdraw, History, Admin tools), and footer with attribution.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card component providing troubleshooting guidance for Bitcoin transaction broadcasting issues, explaining that broadcasting uses IC HTTP outcalls to public APIs without localhost connections or private key storage.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Placeholder card component for monitoring Bitcoin reserve balance and health status, displaying alerts that backend capabilities are not yet exposed and suggesting external monitoring tools.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "Collapsible card displaying a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that the script must be executed externally as the IC canister cannot run Python or connect to localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Collapsible card showing a Python script example for monitoring mining pool earnings and automating reserve transfers, with alerts emphasizing external execution requirements and security warnings about API keys.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "Card component for configuring multisig reserve settings (threshold, public keys, address, redeem script) with a warning that backend implementation is not yet complete.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "A collapsible card component that displays Python code for creating a Bitcoin Core multisig reserve address externally, with warnings that the code must be run outside the app since the Internet Computer cannot connect to localhost.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Exports an array of best practice entries covering common issues like missing backend methods, HTTP outcall failures, and localhost connectivity problems with detailed resolutions and workarounds.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "A searchable, filterable component that displays best practices for Bitcoin transfers, with auto-suggested topics based on transfer failure patterns (e.g., backend method missing, HTTP outcall failures, localhost connectivity issues).",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "A collapsible alert component explaining how Bitcoin transaction broadcasting works via IC HTTP outcalls to public blockchain APIs, with security warnings that private keys must never be stored in the app and signing must be done externally.",
  "frontend/src/components/transfers/MainnetTransactionAlert.tsx": "An alert component displaying important mainnet transaction information including irreversibility, reserve-funded fees, confirmation times, and Segwit support.",
  "frontend/src/components/transfers/ProviderDiagnosticsCard.tsx": "A placeholder card component for displaying blockchain provider diagnostics, currently showing a notice that detailed diagnostic information will be available once the backend implements actual blockchain broadcasting.",
  "frontend/src/components/transfers/SegwitTransactionDetails.tsx": "A card component displaying detailed Segwit transaction information including destination address, amount, estimated fee, and transaction hash with copy-to-clipboard functionality and mainnet warnings.",
  "frontend/src/components/transfers/TransactionConfirmationProgress.tsx": "A card component showing Bitcoin transaction confirmation progress with a progress bar, estimated time remaining, and a link to view the transaction on Blockstream, marking completion at 6 confirmations.",
  "frontend/src/components/transfers/TransactionStatusBadge.tsx": "React component that displays a colored badge indicating transaction status (failed, confirmed, broadcasting, signed, signing, or pending) based on signing and broadcast status props.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Table component displaying transaction history with expandable rows for mainnet transaction details, including type badges, status indicators, and confirmation progress tracking.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Empty file with no content.",
  "frontend/src/components/verification/AdminVerificationRequestsTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/ManualVerificationForm.tsx": "Form component for manually recording Bitcoin purchases with validation for transaction ID (64-char hex) and amount (BTC with up to 8 decimals), converting to satoshis before submission.",
  "frontend/src/components/verification/UserVerificationHistoryTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/VerificationHistoryTable.tsx": "Table component displaying verified Bitcoin purchase records with transaction IDs, amounts, verification dates, and verifier principals, including copy-to-clipboard and blockchain explorer links.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Admin table component for managing withdrawal requests with filtering by status (pending/paid/rejected), sortable columns, and action handlers for approve/reject/mark-paid operations.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Admin dashboard component that displays withdrawal request statistics (pending, paid, rejected counts) and a table for managing withdrawal requests with mark-as-paid and reject actions.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component that displays code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts) with copy-to-clipboard functionality.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "User-facing component that displays a filterable list of withdrawal requests with tabs for all, pending, paid, and rejected statuses, showing amount, method, and account details.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Summary card component showing user's withdrawal request counts by status (pending, paid, rejected) with a link to request new withdrawals.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Hook that manages AI reserve monitoring preference in localStorage, returning a boolean state and setter with a default value of true.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Hook that polls withdrawal requests every 30 seconds and displays toast notifications when withdrawal requests transition to 'PAID' status, tracking already-notified requests to prevent duplicates.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, transaction history, admin status, balances, withdrawal requests, peer transfers, Bitcoin purchases, and reserve status. Includes automatic refetching logic for pending transactions and admin verification.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using OKLCH color space, featuring warm charcoal backgrounds with amber accents, transaction status colors, and utility classes for financial UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Displays admin account information including verification status, principal ID with copy functionality, current BTC balance with USD estimate, and a list of admin capabilities.",
  "frontend/src/pages/AdminManualVerificationPage.tsx": "Admin page for manually recording Bitcoin purchases with a form and history table, includes an alert explaining that instant funding is now the primary flow and manual verification is for special cases.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard showing overview cards for pending withdrawals, recent transactions, and reserve status, with navigation links to withdrawal management, peer transfers, manual verification, and credentials pages.",
  "frontend/src/pages/AdminPeerTransfersPage.tsx": "Admin interface for viewing and monitoring all peer-to-peer credit transfers with status filtering, summary statistics cards, and a sortable table displaying transfer details with copy-to-clipboard functionality.",
  "frontend/src/pages/AdminSendCreditsPage.tsx": "Admin page for crediting BTC directly to user accounts by Principal ID with validation, transaction ID generation, and USD estimate display.",
  "frontend/src/pages/AdminSendToUserPage.tsx": "Admin page with searchable user list for sending BTC credits to peers, includes confirmation dialog and clipboard copy functionality.",
  "frontend/src/pages/AdminVerificationRequestsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/AiLotteryPage.tsx": "AI-powered lottery number generator that attempts to fetch live draw data from data.ny.gov, falls back to local dataset, and generates 3 Powerball outcomes with confidence scores.",
  "frontend/src/pages/BuyBitcoinPage.tsx": "Page for submitting external Bitcoin purchase transactions for instant account funding, displays current balance and purchase history.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Placeholder page for future credit purchase feature with payment integration, currently shows balance and informational content about upcoming functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user's BTC balance, recent transactions, withdrawal status, and navigation cards to key features (buy, send, peer transfers, withdrawals, history) with custodial wallet warning.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with summary statistics (total transactions, credits received/spent, mainnet transaction status) and a detailed table of all transactions. Supports auto-opening specific transfer requests via session storage.",
  "frontend/src/pages/IncomingRequestsPage.tsx": "Shows approved peer-to-peer credit transfers received by the current user, displaying sender principal, amount in BTC, and timestamp with copy-to-clipboard functionality.",
  "frontend/src/pages/OutgoingRequestsPage.tsx": "Displays all peer-to-peer credit transfers sent by the current user with status badges (approved/pending/rejected), sorted by creation date, and includes a link to initiate new transfers.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system feature that displays an alert indicating the backend implementation is not yet available.",
  "frontend/src/pages/SendBtcPage.tsx": "Non-functional page for sending BTC to external addresses that displays a detailed alert explaining the backend sendBTC method is not implemented, with links to alternative features (withdrawal requests and peer transfers).",
  "frontend/src/pages/SendToPeerPage.tsx": "Form page for transferring credits to another user via their principal ID, with balance validation, recipient profile lookup, and confirmation dialog before executing the peer transfer.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "React page component that displays troubleshooting guidance for mainnet Bitcoin transfers, including alerts about missing backend sendBTC implementation and diagnostic information for various transfer issues.",
  "frontend/src/pages/UserVerifyTransactionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/WithdrawPage.tsx": "React page component for submitting withdrawal requests via PayPal or Stripe, displaying balance, handling form submission, and showing withdrawal history with success confirmation UI.",
  "frontend/src/types/mainnet.ts": "TypeScript type definitions for mainnet Bitcoin transactions including signing/broadcast status enums, extended transaction interfaces, and result types for sendBTC and confirmation analysis operations.",
  "frontend/src/utils/adminStatusCache.ts": "Utility for caching admin verification status per principal in localStorage with 5-minute TTL and in-memory session tracking to ensure fresh checks on new page loads.",
  "frontend/src/utils/errors.ts": "Error normalization utility that converts various sendBTC and blockchain API errors into user-friendly messages, handling backend unavailability, network issues, rate limiting, and address validation errors.",
  "frontend/src/utils/fundedNotificationStore.ts": "Per-principal localStorage utility for tracking which withdrawal request IDs have been announced as PAID to prevent duplicate notifications, with baseline initialization and cleanup functions.",
  "frontend/src/utils/transactionStatus.ts": "Utility functions for determining transaction status, formatting status messages, calculating confirmation times, validating Segwit addresses, and determining if transactions need polling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography settings, container queries, animations, and design tokens for a financial application UI.",
  "project_state.json": "Project state file tracking known issues with Bitcoin mainnet broadcasting, existing features for frontend error handling, and pending feature requests to diagnose and fix backend sendBtc mainnet transaction failures."
}