{
  "backend/main.mo": "Main backend actor managing Bitcoin credit balances, peer transfers, withdrawals, transaction history, Bitcoin address generation, reserve management, and admin functions with access control and migration support.",
  "backend/migration.mo": "Migration module that initializes a new userBitcoinAddresses map for storing Bitcoin addresses with metadata including address type, network, and creation timestamp.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: BitcoinAddressDisplay component integration for address generation/display with QR codes, and SendBtcPage integration with transaction signing/broadcasting framework.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with details on Bitcoin address display, transaction management, admin features, and authentication flows.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color tokens for light/dark modes, including transaction status colors and Segwit address display styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining routes for dashboard, send/receive BTC, history, withdrawals, admin pages, and peer transfers with QueryClient and theme provider setup.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial screen displaying user's principal ID with copy functionality, session diagnostics showing token and access control status, and retry/navigation options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Displays a loading screen while verifying admin access, showing elapsed time and the user's principal. After 10 seconds, offers retry and sign-out actions.",
  "frontend/src/components/auth/AdminRoute.tsx": "A route guard component that checks if the caller is an admin using useIsCallerAdmin hook. Shows loading screen while checking, access denied screen if not admin, or renders children if authorized.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card when an authenticated user is not recognized as an admin, showing their principal ID with copy functionality and a retry button for re-checking admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "A full-screen panel prompting unauthenticated users to sign in with Internet Identity, displaying a welcome message and login button.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that toggles between sign-in and sign-out states, clearing query cache and admin status cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal dialog that appears for authenticated users without a profile, prompting them to enter their name to complete profile setup. Cannot be dismissed until completed.",
  "frontend/src/components/balance/BitcoinAddressDisplay.tsx": "Displays or generates a Bitcoin receiving address (P2WPKH mainnet) with copy, QR code generation, and refresh functionality. Shows loading state and handles address creation.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays an estimated USD value for a given BTC amount based on current price, with a disclaimer that the value is an estimate and may fluctuate.",
  "frontend/src/components/buybtc/BuyBitcoinHistoryTable.tsx": "Displays a table of Bitcoin purchase history sorted by verification time, showing transaction IDs, amounts, dates, and status with copy and blockchain explorer link actions.",
  "frontend/src/components/buybtc/InstantFundingForm.tsx": "Form component for instantly crediting BTC balance by submitting a transaction ID and amount, with validation for 64-character hex txids and amounts up to 8 decimal places.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header component displaying the app title and login/logout button with Internet Identity authentication integration.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, navigation menu with icons for all app sections (dashboard, send, receive, buy, withdraw, history, peer transfers, lottery, admin), and footer.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card component providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues via HTTP outcalls.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Placeholder card component for reserve monitoring that displays unavailable status and recommends using external Bitcoin Core RPC or blockchain explorers.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "Collapsible card displaying a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that it must be executed externally.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Collapsible card showing a Python script example for monitoring mining pool earnings and transferring to reserve, with warnings about external execution requirements.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "React component providing a UI panel for configuring Bitcoin multisig reserve settings (threshold, public keys, address, redeem script) with clipboard copy functionality and a warning that backend implementation is not yet complete.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "Collapsible card component displaying Python code snippet for creating Bitcoin Core multisig wallets externally, with warnings that the code must be run outside the app since Internet Computer cannot connect to localhost RPC.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Exports an array of best practice entries providing troubleshooting guidance for common issues like missing backend methods, HTTP outcall failures, and localhost connectivity problems in IC canisters.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "Searchable and filterable component displaying best practices for Bitcoin transfers, with auto-suggestion logic that analyzes error contexts to recommend relevant troubleshooting topics based on failure patterns.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Collapsible alert component explaining how the app broadcasts Bitcoin transactions via IC HTTP outcalls to public blockchain APIs, emphasizing that private key signing must be done externally and the app only handles broadcasting.",
  "frontend/src/components/transfers/MainnetTransactionAlert.tsx": "Alert component displaying important information about mainnet Bitcoin transactions including irreversibility, reserve-funded fees, confirmation times, and Segwit support.",
  "frontend/src/components/transfers/ProviderDiagnosticsCard.tsx": "Card component displaying detailed broadcast attempt logs from multiple blockchain API providers, showing success/failure status, HTTP responses, error messages, and timestamps in collapsible format.",
  "frontend/src/components/transfers/SegwitTransactionDetails.tsx": "Displays detailed information about a Segwit Bitcoin transaction including destination address, amount, estimated fee, and transaction hash with copy-to-clipboard functionality and mainnet warning.",
  "frontend/src/components/transfers/TransactionConfirmationProgress.tsx": "Shows real-time blockchain confirmation progress for a transaction with a progress bar, polling for updates, and links to blockchain explorer; displays different states for broadcast, confirming, and fully confirmed transactions.",
  "frontend/src/components/transfers/TransactionStatusBadge.tsx": "Renders a status badge component that displays the current state of a transaction (signing, broadcasting, awaiting confirmations, confirmed, or failed) with appropriate icons and colors.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a table of transaction history with expandable rows showing detailed mainnet transaction information including status badges, confirmation progress, and Segwit transaction details for applicable transactions.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Empty file with no content.",
  "frontend/src/components/verification/AdminVerificationRequestsTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/ManualVerificationForm.tsx": "Form component for admins to manually record Bitcoin purchases by entering a transaction ID and amount with validation for txid format (64-char hex) and BTC amount (up to 8 decimal places).",
  "frontend/src/components/verification/UserVerificationHistoryTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/VerificationHistoryTable.tsx": "Displays a sortable table of Bitcoin purchase verification records with transaction IDs, amounts, dates, and verifier principals. Includes copy-to-clipboard and external blockchain explorer links for each transaction.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Admin table component for managing withdrawal requests with filtering by status (pending/paid/rejected), sortable columns, and action buttons for approving, rejecting, and marking requests as paid.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Admin dashboard displaying withdrawal request statistics (pending/paid/rejected counts) and a table for managing requests. Includes manual processing alert and mutation handlers for marking paid or rejecting requests.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component showing code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts). Includes copy-to-clipboard functionality for code snippets.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "User-facing component displaying withdrawal request history with tab-based filtering by status (all/pending/paid/rejected). Shows request details including amount, method, account, and status badges.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Summary card showing user's withdrawal request counts by status (pending/paid/rejected) with a link to the detailed withdrawal page. Displays empty state when no requests exist.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated actor instance for backend communication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "React hook that manages AI reserve monitoring preference in localStorage, returning a boolean state and setter that defaults to true (monitoring enabled).",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "React hook that polls withdrawal requests every 30 seconds and displays toast notifications when requests transition to PAID status, using a notification store to prevent duplicate alerts.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, transaction history, withdrawal requests, balances, and Bitcoin operations with automatic refetching for pending transactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, featuring warm charcoal backgrounds with amber accents and transaction status color indicators.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin page displaying administrator status, principal ID, account balance, and admin capabilities with copy-to-clipboard functionality.",
  "frontend/src/pages/AdminManualVerificationPage.tsx": "Admin page for manually recording Bitcoin purchases with a form and history table, primarily for historical tracking since instant funding is now the standard flow.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard overview page displaying key metrics (pending withdrawals, transactions, reserve status) and navigation cards to withdrawal management, peer transfers, send credits, and send to user features.",
  "frontend/src/pages/AdminPeerTransfersPage.tsx": "Admin page for viewing and monitoring all peer-to-peer credit transfers with filtering by status (pending, approved, rejected, deleted), displaying transfer details in a sortable table with copy-to-clipboard functionality.",
  "frontend/src/pages/AdminSendCreditsPage.tsx": "Admin form page for crediting BTC directly to a user account by entering Principal ID, transaction ID, and BTC amount with validation and USD estimate display.",
  "frontend/src/pages/AdminSendToUserPage.tsx": "Admin page with searchable user list and form to send BTC credits to selected users, featuring confirmation dialog and USD estimate display.",
  "frontend/src/pages/AdminVerificationRequestsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/AiLotteryPage.tsx": "AI-powered lottery number generator page that attempts to fetch historical draw data from data.ny.gov, falls back to local dataset if unavailable, and generates three lottery outcomes with confidence scores mixing recent winners and other numbers.",
  "frontend/src/pages/BuyBitcoinPage.tsx": "User-facing page for submitting Bitcoin purchase transactions for instant account funding, displaying current BTC balance and purchase history table.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Displays a page for purchasing Bitcoin credits with current balance, explanatory alerts, and a placeholder UI indicating payment integration is coming soon.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing user balance, custodial warning alert, Bitcoin address display, withdrawal status summary, and navigation cards for send/receive/history/buy actions; shows sign-in panel when not authenticated.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with summary statistics (total transactions, credits received/spent, mainnet transaction status) and a detailed transfer history table with optional auto-open for specific request IDs.",
  "frontend/src/pages/IncomingRequestsPage.tsx": "Shows approved peer-to-peer transfers received by the user with sender details, amounts in BTC, timestamps, and copy-to-clipboard functionality.",
  "frontend/src/pages/OutgoingRequestsPage.tsx": "Displays peer-to-peer transfers sent by the user with status badges, recipient details, amounts, and a prompt to send new transfers if none exist.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/ReceiveBtcPage.tsx": "Page for receiving Bitcoin that displays the user's Bitcoin address with QR code, instructions for receiving funds, and security notices about Segwit addresses and transaction confirmations.",
  "frontend/src/pages/SendBtcPage.tsx": "Page component for sending Bitcoin to external addresses with form validation, transaction submission, error handling, and display of broadcast attempts and confirmation progress.",
  "frontend/src/pages/SendToPeerPage.tsx": "Page component for transferring credits between platform users using Principal IDs, with validation, confirmation dialog, and balance checking.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Troubleshooting guide page that documents the missing backend sendBTC method implementation and provides diagnostic information for mainnet transaction issues.",
  "frontend/src/pages/UserVerifyTransactionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/WithdrawPage.tsx": "Page component for requesting withdrawals via PayPal or Stripe, displaying balance, handling form submission, and showing withdrawal history with success confirmation.",
  "frontend/src/types/mainnet.ts": "TypeScript type definitions for mainnet Bitcoin transactions including signing/broadcast status, confirmation tracking, broadcast attempts, and result types for sendBTC operations.",
  "frontend/src/utils/adminStatusCache.ts": "Utility for caching admin verification status per principal in localStorage with TTL and session-based tracking to ensure fresh checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes various error formats into user-friendly messages, with specific handling for Bitcoin operations (sendBTC, address validation, signing, broadcasting), HTTP outcalls, network errors, and backend method availability.",
  "frontend/src/utils/fundedNotificationStore.ts": "Per-principal localStorage-backed store that tracks which withdrawal request IDs have been notified as PAID to prevent duplicate notifications, with functions to load, save, check, mark, initialize baseline, and clear notification state.",
  "frontend/src/utils/transactionStatus.ts": "Provides utility functions for Bitcoin transaction status management including status message generation, confirmation time estimation, progress calculation, Segwit address validation, and polling determination based on signing/broadcast status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to store, retrieve, and clear parameters including sensitive data removal from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom fonts (Inter, JetBrains Mono), financial-themed shadows, and accordion animations with typography and container query plugins.",
  "project_state.json": "Project state tracking document for a Bitcoin address generation and transaction signing project, documenting architectural notes, known deployment issues, existing features for address display and transaction sending, and pending framework implementation requests."
}