{
  "backend/main.mo": "Main actor implementing a Bitcoin credit transfer system with balance management, transaction tracking, withdrawal requests, reserve management, multisig configuration, and access control. Includes migration support and defines core types like SendBTCRequest (without address validation fields), TransferStatus, ReserveStatus, and various request/response structures.",
  "backend/migration.mo": "Migration module that converts legacy SendBTCRequest records (containing addressValidation field) to new SendBTCRequest records (without addressValidation), transforming both transferRequests and failedTransfersToRetry maps during actor upgrade.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of Bitcoin address validation from SendBtcPage.tsx, enhanced error handling for blockchain API rejections, and removal of address validation from AdminPage.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and utilities, with detailed descriptions of SendBtcPage.tsx (address validation removed), error handling updates, and admin page modifications.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, including warm amber/charcoal financial dashboard theme and lottery-specific component styles.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, authentication gate using Internet Identity, admin guard with cache-based verification, automatic 500-credit assignment for admins, profile setup modal, and route definitions including new AI Lottery page.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Full-screen component displaying an access denied message for non-admin users, showing their principal ID with copy functionality, session diagnostics (token detection, access control status), and action buttons for retry, sign out, and navigation home.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen shown during admin access verification with a spinner, elapsed time counter, masked principal display, and recovery actions (retry/sign out) that appear after 10 seconds.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Warning card component that appears for authenticated non-admin users, displaying their principal ID with copy functionality and a retry button to re-check admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Centered full-screen panel with a welcome message and Internet Identity sign-in button for unauthenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication toggle button that handles both login and logout, clearing query cache and admin status on logout, with loading states and error handling for duplicate authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name during initial profile setup, with form validation and submission to save the user profile.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Component displaying USD value estimate for a BTC amount based on current price, with loading skeleton and disclaimer about market fluctuations.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky header with logo, navigation links (buy credits, send, history, puzzle rewards, withdraw, AI lottery), admin link for authorized users, user profile display, login button, and mobile menu sheet.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, content area with admin troubleshooting card, and footer with copyright and caffeine.ai attribution link.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "A collapsible card component that displays troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues, including connectivity problems, API timeouts, and fee-related issues.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "A real-time monitoring component that displays reserve status including BTC balance, outstanding credits, coverage ratio, and readiness indicators with optional polling and manual refresh capabilities.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "A collapsible card displaying a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that it must be executed externally since the IC canister cannot connect to localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "A collapsible card showing a Python script example for monitoring mining pool earnings and automating reserve transfers, with clear warnings that it must be run externally and not within the app.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "A form component for storing and viewing multisig configuration metadata (threshold, pubkeys, address, redeem script) with copy functionality and warnings that actual multisig operations must be handled externally.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "A collapsible card displaying Python code for creating Bitcoin Core multisig addresses, with warnings that the script must be executed externally on a machine with Bitcoin Core node access.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "TypeScript data file defining best practice entries with categories (Connectivity, Provider, Mempool, Network), keywords for search/matching, and detailed troubleshooting guidance text.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "React component that displays a searchable best practices and troubleshooting guide with auto-suggestions based on failure reasons, category filtering, and accordion-style expandable entries.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Collapsible informational alert component explaining how Bitcoin transaction broadcasting works in the app, emphasizing that private keys must never be entered and all signing happens externally.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Table component displaying transaction history with type badges, timestamps, amounts with USD estimates, and action buttons to view details via VerifyTransferDialog.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Modal dialog for viewing detailed transfer request status with auto-refresh, copy transaction ID functionality, manual refresh button, and troubleshooting navigation for failed transfers.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "A table component for admins to view, filter (pending/paid/rejected), and manage withdrawal requests with actions to mark as paid or reject with reason. Includes copy-to-clipboard for principal IDs and sorting logic that prioritizes pending requests.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Dashboard component displaying summary cards for withdrawal request counts (pending, paid, rejected) with a call-to-action button to scroll to the inbox when pending requests exist.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component showing code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts). Includes copy-to-clipboard functionality for code snippets.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Displays a sorted table of user withdrawal requests with status badges, timestamps, amounts, and rejection reasons. Shows an empty state when no requests exist.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Card component showing a summary grid of withdrawal request counts by status (pending/paid/rejected) with an informational alert explaining the manual payout process. Includes a link to request new withdrawals.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Custom hook managing a boolean localStorage preference for AI reserve monitoring (defaults to enabled), returning state and setter for the Reserve tab toggle.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "React hook that monitors withdrawal requests and displays a toast notification when a request transitions from PENDING to PAID status, ensuring each notification is shown only once per request ID per principal using persistent storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API interactions including user profiles, balances, Bitcoin wallet operations, transaction history, withdrawal requests, reserve management, and BTC price data.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, featuring warm charcoal backgrounds with amber accents and specialized styles for lottery and financial UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin verification page displaying authenticated admin's principal ID, current balance with USD estimate, and a list of admin capabilities including credit grants and withdrawal management.",
  "frontend/src/pages/AdminPage.tsx": "Comprehensive admin dashboard with tabs for sending BTC, managing reserve deposits/withdrawals, processing user withdrawal requests, monitoring reserve status, and viewing transaction history with broadcast troubleshooting tools.",
  "frontend/src/pages/AiLotteryPage.tsx": "React page component that generates AI-powered lottery number predictions by attempting to fetch historical draw data from data.ny.gov, falling back to a local dataset if unavailable, and displaying three outcome predictions with confidence scores.",
  "frontend/src/pages/BuyCreditsPage.tsx": "React page component for purchasing Bitcoin credits by submitting a mainnet transaction ID and amount, displaying current balance with USD estimate, and handling blockchain verification through the backend.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user's BTC balance with USD estimate, recent transactions, Bitcoin wallet info, withdrawal status summary, and informational alerts about the custodial reserve model and security notices.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays all user transactions in a table with summary statistics (total transactions, credits received, total spent) and supports opening specific transfer requests via session storage.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system feature that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/SendBtcPage.tsx": "React page for sending BTC that handles destination address input, amount validation, network fee estimation, real-time transfer status polling during broadcast, and displays detailed status updates throughout the transaction lifecycle.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Displays detailed troubleshooting information for Bitcoin transfer requests, including status analysis, blockchain confirmation checks, and options to retry failed broadcasts or refresh status.",
  "frontend/src/pages/WithdrawPage.tsx": "Provides a form for users to submit manual withdrawal requests to convert credits to external funds, displays withdrawal history, and shows funded withdrawal notifications.",
  "frontend/src/utils/adminStatusCache.ts": "Manages per-principal admin status caching in localStorage with 5-minute TTL and session-based verification tracking to ensure fresh checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes backend error messages into user-friendly text for Send BTC operations and reserve deposit validation, handling blockchain API errors, address validation failures, and insufficient balance scenarios.",
  "frontend/src/utils/fundedNotificationStore.ts": "Manages per-principal localStorage tracking of which withdrawal request IDs have been announced as PAID to prevent duplicate notifications across sessions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, extended theme tokens (colors, border radius, fonts, shadows), accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking architectural decisions (custodial Bitcoin wallets, admin flows, BlockCypher API integration, Telegram bot), known issues (admin verification delays, failed on-chain broadcasts, mobile login button missing, address validation errors), and feature scope including USD display and AI lottery page."
}