{
  "backend/main.mo": "Main actor implementing Bitcoin credit transfer system with balance management, transaction tracking, withdrawal requests, peer transfers, admin controls, reserve management, and self-custody wallet functionality using threshold ECDSA for Bitcoin address generation.",
  "backend/migration.mo": "Migration module defining data structures for upgrade compatibility, currently implementing a pass-through migration that preserves existing state including balances and credit adjustments.",
  "feature_evidence.json": "Feature evidence report documenting four self-custody wallet features (generate wallet button, wallet list, transfer form, transfer history) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with detailed descriptions of their functionality and implementation status.",
  "frontend/index.css": "Global CSS with Tailwind layers defining design tokens in OKLCH format for light/dark themes, including transaction status colors and Segwit address styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component configuring React Query, TanStack Router with all routes (including new /self-custody-wallets route), theme provider, and layout wrapper.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial screen displaying principal ID with copy functionality, session diagnostics showing token and access control status, and retry/navigation options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Displays a loading screen while verifying admin access, showing elapsed time and offering retry/sign-out actions after 10 seconds. Includes a masked principal display and animated loader.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard component that checks if the caller is an admin using useIsCallerAdmin hook, showing loading/denied screens or rendering children based on admin status.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card for authenticated non-admin users, showing their principal ID with copy functionality and a retry button for re-checking admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Full-screen sign-in panel for unauthenticated users with a button to trigger Internet Identity login.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggle button for authentication that handles both sign-in and sign-out, clearing query cache and admin status on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, creating a UserProfile with optional Bitcoin wallet field.",
  "frontend/src/components/balance/AddressHistoryView.tsx": "Displays a sorted list of all user Bitcoin addresses with status badges (active/used), copy functionality, and blockchain explorer links.",
  "frontend/src/components/balance/BitcoinAddressDisplay.tsx": "Shows the user's primary Bitcoin address with copy, QR code generation, and address rotation functionality, including rotation notices and address history tracking.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays USD value estimate for a BTC amount based on current price, with loading states and disclaimer about market fluctuations.",
  "frontend/src/components/buybtc/BuyBitcoinHistoryTable.tsx": "Displays a table of Bitcoin purchase history with transaction details, amounts, dates, and actions to copy txids or view on blockchain explorer. Shows loading state and empty state when no purchases exist.",
  "frontend/src/components/buybtc/InstantFundingForm.tsx": "Form component for submitting Bitcoin transaction details (txid and amount) to instantly credit user accounts. Validates inputs, converts BTC to satoshis, and displays current balance with success/error feedback.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header component with title and authentication button that handles Internet Identity login/logout and clears query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, navigation menu with routes (dashboard, send, receive, buy, withdraw, history, etc.), and footer. Shows admin-only links conditionally and includes copyright/license information.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues, explaining that broadcasting uses IC HTTP outcalls to public APIs without localhost access.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Placeholder card for reserve balance monitoring that displays a warning that backend capabilities are not exposed and suggests using external Bitcoin Core RPC or blockchain explorers.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "Collapsible card displaying a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that this must be executed externally as the IC canister cannot run Python or access localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Displays a collapsible card with a Python code snippet for monitoring mining pool earnings and transferring BTC to a reserve wallet. Includes warnings that the script must be run externally and not within the app.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "Provides a UI panel for configuring multisig reserve settings (threshold, public keys, address, redeem script) with copy-to-clipboard functionality. Displays an alert noting that backend implementation is not yet complete.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "Shows a collapsible card containing Python code for creating a Bitcoin Core multisig reserve address with threshold signatures. Warns users that the code must be executed externally on a machine with Bitcoin Core access.",
  "frontend/src/components/selfcustody/GenerateSelfCustodyWalletButton.tsx": "Renders a button to generate self-custody Bitcoin wallets using threshold ECDSA, with loading states and toast notifications. Displays an alert indicating backend implementation is still required.",
  "frontend/src/components/selfcustody/SelfCustodyEducationPanel.tsx": "Provides an accordion-based educational panel explaining self-custody wallets, security best practices, risks, and comparison with threshold ECDSA managed addresses.",
  "frontend/src/components/selfcustody/SelfCustodySecurityModal.tsx": "Displays a modal dialog requiring users to acknowledge security warnings and responsibilities before using self-custody wallets, with checkboxes for required acknowledgments and educational content.",
  "frontend/src/components/selfcustody/SelfCustodyTransferHistoryTable.tsx": "Displays a table of self-custody transfer history with status badges, formatted dates/amounts, and copy/external link actions. Shows alerts when backend implementation is missing or no transfers exist.",
  "frontend/src/components/selfcustody/SelfCustodyTransferSuccess.tsx": "Success screen component showing transfer confirmation details (ID, destination address, amount) with copy-to-clipboard and blockchain explorer link functionality.",
  "frontend/src/components/selfcustody/SelfCustodyWalletList.tsx": "Lists user's self-custody wallets with addresses, balances, and metadata in card format. Shows alerts when backend is not implemented or no wallets exist.",
  "frontend/src/components/selfcustody/ThresholdEcdsaVsSelfCustodyComparison.tsx": "Side-by-side comparison card showing differences between Threshold ECDSA (platform-managed, recovery possible) and Self-Custody (user-managed, full control) wallet options.",
  "frontend/src/components/selfcustody/TransferToSelfCustodyForm.tsx": "Form for transferring BTC to self-custody wallets with amount validation, wallet selection, balance checking, and success state handling. Shows alert when backend implementation is missing.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Defines best practice entries for troubleshooting Bitcoin transfer issues, including backend method implementation, HTTP outcall failures, and network configuration problems. Contains structured documentation with symptoms, root causes, and resolutions for common integration issues.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "Searchable, filterable best practices guide that auto-suggests relevant topics based on transfer failure patterns and error contexts (backend methods, HTTP outcalls, rate limiting, etc.).",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "A collapsible informational component that explains how Bitcoin transaction broadcasting works in the app, emphasizing that private keys must never be stored and all signing is done externally while the app only broadcasts pre-signed transactions via IC HTTP outcalls.",
  "frontend/src/components/transfers/MainnetTransactionAlert.tsx": "An alert component displaying important information about mainnet Bitcoin transactions, including warnings about irreversibility, reserve-funded fees, confirmation times, and Segwit support.",
  "frontend/src/components/transfers/ProviderDiagnosticsCard.tsx": "A collapsible card component that displays detailed diagnostic logs from blockchain API provider broadcast attempts, showing success/failure status, HTTP responses, and error messages for each provider.",
  "frontend/src/components/transfers/SegwitTransactionDetails.tsx": "A card component displaying detailed information about a Segwit Bitcoin transaction including destination address, amount, estimated fee, Segwit address type, and transaction hash with copy-to-clipboard functionality.",
  "frontend/src/components/transfers/TransactionConfirmationProgress.tsx": "A card component that displays real-time blockchain confirmation progress for a transaction, polling for updates and showing a progress bar, confirmation count (0-6), and estimated time remaining until full confirmation.",
  "frontend/src/components/transfers/TransactionStatusBadge.tsx": "A badge component that displays the current status of a transaction based on signing status, broadcast status, and confirmation count with appropriate icons and colors for states like pending, broadcasting, failed, and confirmed.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "A table component displaying transaction history with expandable rows that show detailed mainnet transaction information including status badges, confirmation progress, and Segwit transaction details for applicable transactions.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "File content was truncated, but appears to be a dialog component for verifying transfer details before submission.",
  "frontend/src/components/verification/AdminVerificationRequestsTable.tsx": "Empty file for admin verification requests table component.",
  "frontend/src/components/verification/ManualVerificationForm.tsx": "Form component for manually verifying Bitcoin purchases by entering transaction ID and BTC amount. Validates input format (64-char hex txid, positive BTC with max 8 decimals), converts to satoshis, and calls recordBitcoinPurchase mutation with success/error handling.",
  "frontend/src/components/verification/UserVerificationHistoryTable.tsx": "Empty file for user verification history table component.",
  "frontend/src/components/verification/VerificationHistoryTable.tsx": "Table component displaying Bitcoin purchase verification history with transaction IDs, amounts, verification dates, and verifier principals. Includes copy-to-clipboard and blockchain explorer links, sorted by verification timestamp.",
  "frontend/src/components/wallet/CustodialWarningModal.tsx": "Modal dialog educating users about threshold ECDSA wallet architecture before first use. Requires users to acknowledge understanding of distributed key management, security model, and their responsibilities through checkboxes.",
  "frontend/src/components/wallet/KeyExportInstructions.tsx": "Educational accordion component explaining threshold ECDSA security model, comparing it to traditional wallets, and describing how distributed signing works without exposing private keys. Emphasizes security advantages and user control through Internet Identity.",
  "frontend/src/components/wallet/PrivateKeyDisplay.tsx": "Displays educational information about threshold ECDSA security, explaining why private keys cannot be directly accessed and showing the enhanced security benefits of distributed key shares across IC nodes.",
  "frontend/src/components/wallet/PrivateKeyRevealConfirmation.tsx": "Provides a confirmation dialog with four checkboxes requiring users to acknowledge Bitcoin security principles and threshold ECDSA architecture before viewing security information.",
  "frontend/src/components/wallet/PublicKeyDisplay.tsx": "Displays the Bitcoin public key in both hexadecimal and base64 formats with copy-to-clipboard functionality, explaining that public keys are safe to share.",
  "frontend/src/components/wallet/SecurityEducationPanel.tsx": "Provides an accordion-based educational panel explaining threshold ECDSA, self-custody vs custodial wallets, and Bitcoin security best practices.",
  "frontend/src/components/wallet/WalletAddressList.tsx": "Displays a list of Bitcoin addresses with their types, networks, creation dates, and provides copy and blockchain explorer link functionality for each address.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Renders a filterable and sortable table of withdrawal requests with tabs for different statuses (pending, paid, rejected) and action buttons for admin operations.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Admin dashboard component that displays withdrawal request statistics (pending, paid, rejected counts) and renders a table of all withdrawal requests with actions to mark as paid or reject them.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component that displays code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts) with copy-to-clipboard functionality.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "User-facing component that displays a filterable list of withdrawal requests with tabs for all, pending, paid, and rejected statuses, showing amount, method, account details, and timestamps.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Summary card component showing user's withdrawal request counts by status (pending, paid, rejected) with a link to request new withdrawals or view details.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Hook that manages AI reserve monitoring preference in localStorage, returning a boolean state and setter that defaults to true (enabled) if no preference exists.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Hook that polls withdrawal requests every 30 seconds and displays toast notifications when requests transition to 'PAID' status, using localStorage to track already-notified requests per user.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including balance queries, user profiles, transactions, Bitcoin operations (send/receive), peer transfers, withdrawals, verification requests, self-custody wallets, and admin functions.",
  "frontend/src/hooks/useSelfCustodyEducationAcknowledged.ts": "Custom hook that manages localStorage state to track whether a user has acknowledged the self-custody education modal, keyed by their principal ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, including amber primary colors, transaction status colors, and financial UI component styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider context wrappers around the main App component.",
  "frontend/src/pages/AdminAddressManagementPage.tsx": "Admin page displaying all user Bitcoin addresses with search functionality, statistics (total/active/used addresses), and blockchain explorer links for address management.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin page showing administrator credentials including principal ID, account balance, and a list of admin capabilities like managing withdrawals and verifications.",
  "frontend/src/pages/AdminManualVerificationPage.tsx": "Admin page for manually recording Bitcoin purchases with a form and history table, primarily for historical record-keeping since instant funding is now the standard flow.",
  "frontend/src/pages/AdminPage.tsx": "Main admin dashboard displaying system overview cards (pending withdrawals, transactions, reserve status) with navigation links to withdrawal management, peer transfers, verification, and address management pages.",
  "frontend/src/pages/AdminPeerTransfersPage.tsx": "Admin page for viewing and monitoring all peer-to-peer credit transfers with filtering by status (pending/approved/rejected/deleted), displaying transfer details in a table with copy-to-clipboard functionality, and showing summary statistics.",
  "frontend/src/pages/AdminSendCreditsPage.tsx": "Admin page for crediting BTC directly to a user account by entering their Principal ID, Bitcoin transaction ID, and amount, with transaction verification to prevent duplicate credits.",
  "frontend/src/pages/AdminSendToUserPage.tsx": "Admin page for sending BTC credits to users by searching and selecting from all registered users, with a confirmation dialog before executing the transfer.",
  "frontend/src/pages/AdminVerificationRequestsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/AiLotteryPage.tsx": "Page that generates AI-predicted lottery number outcomes by attempting to fetch historical draw data from data.ny.gov (with fallback to local dataset), mixing recent winners with \"wrong\" numbers to produce three lottery predictions with confidence scores.",
  "frontend/src/pages/BuyBitcoinPage.tsx": "Page for users to submit Bitcoin purchase transactions for instant account funding, displaying current balance and purchase history with a form to enter transaction details.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Placeholder page for purchasing Bitcoin credits showing current balance and explaining the future payment integration feature that is currently under development.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user's BTC balance, Bitcoin address, withdrawal status, and navigation cards for buying, sending, withdrawing, and viewing transaction history. Shows threshold ECDSA security alert and requires authentication.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays all credit transactions and mainnet transfers with summary statistics (total transactions, credits received/spent, pending/completed mainnet transactions). Supports auto-opening specific transfer requests via session storage.",
  "frontend/src/pages/IncomingRequestsPage.tsx": "Displays all approved peer-to-peer transfers received by the user, showing transfer amounts, sender principals, and timestamps with copy-to-clipboard functionality.",
  "frontend/src/pages/OutgoingRequestsPage.tsx": "Shows all peer-to-peer transfers sent by the user with status badges (approved/pending/rejected), recipient information, and amounts. Includes a prompt to send new transfers if none exist.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/ReceiveBtcPage.tsx": "Page for receiving Bitcoin with tabs for active address display (with QR code) and address history. Includes instructions and security notices about Segwit addresses and transaction confirmations.",
  "frontend/src/pages/SelfCustodyWalletsPage.tsx": "Comprehensive self-custody wallet management page with education panel, security modal, wallet generation, wallet list display, transfer form, and transfer history. Requires authentication and user acknowledgment of security responsibilities.",
  "frontend/src/pages/SendBtcPage.tsx": "Page component for sending Bitcoin to external addresses with form validation, network selection (mainnet/testnet), transaction broadcasting with multiple provider attempts, and detailed error diagnostics including confirmation progress tracking.",
  "frontend/src/pages/SendToPeerPage.tsx": "Page component for transferring credits between platform users using Principal IDs, with recipient validation, profile lookup, balance checking, and confirmation dialog before sending.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Empty file placeholder for transfer troubleshooting functionality.",
  "frontend/src/pages/UserVerifyTransactionPage.tsx": "Empty file placeholder for user transaction verification functionality.",
  "frontend/src/pages/WalletKeysPage.tsx": "Page displaying wallet cryptographic information including public keys, addresses, and address history with educational content about threshold ECDSA security and custodial warnings stored in localStorage.",
  "frontend/src/pages/WithdrawPage.tsx": "Page for requesting fiat withdrawals via PayPal or Stripe with amount input, account details, balance validation, success confirmation, and withdrawal history display with funded notification hooks.",
  "frontend/src/types/mainnet.ts": "TypeScript type definitions for mainnet Bitcoin transactions including signing/broadcast status enums, extended transaction interface, broadcast attempt logs, and result types for send and confirmation operations.",
  "frontend/src/types/selfcustody.ts": "TypeScript type definitions for self-custody wallet features including wallet structure, transfer records, and transfer status enum (pending/confirmed/failed).",
  "frontend/src/utils/adminStatusCache.ts": "Utility for caching admin verification status per principal in localStorage with 5-minute TTL and in-memory session tracking to ensure fresh checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes and formats error messages from various sources (strings, Error objects, backend traps) into user-friendly messages. Handles specific error patterns for Bitcoin transactions, authorization, balance, withdrawals, peer transfers, addresses, and unimplemented backend features.",
  "frontend/src/utils/fundedNotificationStore.ts": "Manages per-principal localStorage-backed tracking of withdrawal request IDs that have been announced as PAID to prevent duplicate notifications. Provides functions to load, save, check, mark, initialize baseline, and clear notification states.",
  "frontend/src/utils/transactionStatus.ts": "Provides utility functions for Bitcoin transaction status management including status message generation, confirmation time estimation, progress calculation, Segwit address validation, and determining if status polling is needed based on signing/broadcast status and confirmations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence for parameters like admin tokens and functions to clear sensitive parameters from URLs.",
  "frontend/src/utils/walletEducation.ts": "Defines educational content constants for Bitcoin wallet security including security warnings, best practices, wallet type explanations, tooltip content, and self-custody education materials. Covers topics like private key security, threshold ECDSA, and user responsibilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom fonts (Inter, JetBrains Mono), financial-themed shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for a self-custody Bitcoin wallet application with frontend React components and backend ICP canister integration. Contains 5 existing features (wallet generation, wallet list, transfer form, transfer history, React Query hooks) and 9 pending feature requests for backend implementation including wallet generation, balance fetching, transfer creation, and history retrieval."
}