{
  "backend/main.mo": "Motoko backend actor managing user profiles, credit balances, BTC transfer requests, transactions, and admin authorization with access‑controlled queries and updates.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend source files and their roles in the credit and admin management UI.",
  "frontend/index.css": "Tailwind base and custom OKLCH color system variables defining light and dark theme tokens for the frontend.",
  "frontend/index.html": "HTML root page loading the React app and mounting it into the root element.",
  "frontend/src/App.tsx": "Main React router and auth gate setup handling user login, admin checks, initial admin credit assignment, and layout rendering.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI screen shown when admin verification fails, offering principal copy, retry, troubleshooting info, and navigation options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen displayed during admin verification with elapsed time tracking and optional retry/sign‑out actions after delay.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning and tools for non-admin authenticated users, including copying their principal and retrying the admin check.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles user login/logout via Internet Identity and resets related caches on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name to complete profile setup.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar showing links, profile info, admin visibility logic, and mobile menu handling.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout wrapper including header, footer, and an admin troubleshooting banner.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Renders a table of past transactions with formatting, type labels, and a verify‑transfer action.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Dialog for submitting a blockchain transaction ID to verify a specific BTC transfer request.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking. Includes helper logic for creating AuthClient instances and exposing identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, balances, admin status, and transactions. Integrates actor access and Internet Identity, with caching and toast notifications.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes. Adds utility classes and component-level styles for financial UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider. Loads global styles and mounts the root component.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Displays verified admin details including principal ID, balance, and available admin capabilities. Provides navigation to the main admin panel.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard for transferring credits, sending BTC, viewing transactions, and managing users. Handles input validation, fee estimation, and user interactions.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Allows users to purchase credits by submitting a Bitcoin transaction ID and amount. Shows current balance and processes credit purchase requests with validation and feedback.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user balance, transaction counts, quick actions, and recent activity using query hooks.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full transaction history with credit/debit stats and a detailed transaction table.",
  "frontend/src/pages/SendBtcPage.tsx": "Form for sending BTC with balance display, fee estimation, validation, and transaction submission.",
  "frontend/src/utils/adminStatusCache.ts": "LocalStorage-based cache for per-principal admin status with TTL and in-memory verification tracking.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters across navigation using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and container settings.",
  "project_state.json": "Tracks project version, app goals for BTC credit sales and transfers, architectural notes, known admin/auth issues, and existing feature requirements."
}