{
  "backend/main.mo": "Main actor implementing a Bitcoin credit transfer system with custodial wallet management, transaction tracking, reserve management, withdrawal requests, multisig configuration, access control, and migration support for adding addressValidation field to SendBTCRequest.",
  "backend/migration.mo": "Migration module that transforms old SendBTCRequest records to new ones by adding an optional addressValidation field (set to null for existing records) in both transferRequests and failedTransfersToRetry maps.",
  "feature_evidence.json": "Feature evidence report documenting two frontend features: visual confirmation indicators for transfer status (broadcasted/confirmed) in VerifyTransferDialog and TransferTroubleshootingPage, and real-time broadcast status updates with English progress messages in Send BTC flows.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including styling (OKLCH color system with lottery components), routing (with /ai-lottery), authentication, query hooks (including new useTransferRequestStatus for polling transfer status), and pages (Dashboard, BuyCredits, SendBtc with real-time broadcast updates, History, Admin, etc.).",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH-based design tokens for light/dark modes with warm amber/charcoal palette, plus custom lottery component classes with gradient headers, outcome cards, confidence badges, and five colorful ball variants with 3D shadows.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, AuthGate for unauthenticated users showing LoggedOutSignInPanel, AdminGuard with cache-aware admin verification, automatic 500-credit assignment for verified admins, ProfileSetupModal for new users, and routes including /ai-lottery.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial screen displaying principal ID with copy functionality, session diagnostics showing token detection and access control initialization status, and action buttons for retry, sign out, and return home.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Displays a loading screen while verifying admin access, showing elapsed time and offering retry/sign-out actions after 10 seconds. Includes a masked principal display and animated loader.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Shows a warning card when an authenticated user lacks admin access, displaying their principal ID with copy functionality and a retry button. Only visible when user is authenticated but not an admin.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Renders a centered sign-in panel for unauthenticated users with an Internet Identity login button. Handles login state and disables button during authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a dual-purpose button for signing in/out with Internet Identity. Clears query cache and admin status on logout, handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name during initial profile setup. Non-dismissible until name is submitted via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays USD equivalent of a BTC amount based on current price, with loading skeleton and disclaimer about market fluctuations. Shows unavailable message when price data is missing.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with logo, navigation links (Buy Credits, Send BTC, History, etc.), admin link when authorized, and mobile menu sheet. Shows user profile name and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component wrapping the app with header, main content area with admin troubleshooting card, and footer with caffeine.ai attribution. Provides consistent page structure.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance for Bitcoin transaction broadcasting issues, including API connectivity, mempool congestion, and fee problems. Embeds BestPracticesSection component.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "React component that displays real-time reserve status monitoring with polling, showing BTC balance, outstanding credits, coverage ratio, and readiness indicators. Includes manual refresh capability and formatted timestamps for last update.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "Collapsible card component that displays a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that the script must be executed externally since the IC canister cannot run Python or connect to localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Collapsible card component showing a Python script example for monitoring mining pool earnings and automating reserve transfers, with alerts emphasizing external execution requirements and security warnings about API keys.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "Form component for storing and viewing multisig configuration metadata (threshold, pubkeys, address, redeem script) with copy-to-clipboard functionality, clarifying that actual multisig creation/signing must be done externally.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "Collapsible card displaying Python code snippet for creating Bitcoin Core multisig addresses externally, with warnings that the code cannot run within the app and must be executed on a machine with Bitcoin Core access.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "TypeScript data file defining best practice entries for troubleshooting Bitcoin transfers, organized by category (Connectivity, Provider, Mempool, Network) with keywords, titles, and detailed explanatory content.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "React component that displays a searchable best practices and troubleshooting guide with auto-suggested entries based on failure reasons and diagnostic data. Uses tabs, accordion UI, and filters entries by category and search query.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Collapsible alert component that explains how Bitcoin transaction broadcasting works in the app, emphasizing that the app only broadcasts pre-signed transactions via IC HTTP outcalls and never handles private keys.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Table component displaying transaction history with type badges, timestamps, amounts with USD estimates, and action buttons to view details. Auto-opens verification dialog for a specified initial request ID.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Modal dialog that displays detailed transfer request status with live refresh, status badges, transaction ID copying, manual refresh, and troubleshooting navigation. Shows different UI states based on transfer status (IN_PROGRESS, VERIFIED, COMPLETED, FAILED, EVICTED).",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Displays a table of withdrawal requests with admin actions (mark paid, reject) and filtering by status (pending, paid, rejected). Includes dialogs for confirming actions, copying principal IDs, and sorting requests with pending prioritized.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Shows an overview dashboard with cards displaying counts of pending, paid, and rejected withdrawal requests. Includes a call-to-action button to scroll to the inbox when pending requests exist.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component displaying code examples for PayPal and Stripe payout API integrations. Includes copy-to-clipboard functionality for OAuth, payout, and bank transfer snippets.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Displays a table of user withdrawal requests sorted by timestamp, showing request ID, date, amount, payment method, and status with badges. Shows empty state when no requests exist.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Card component showing summary counts of pending, paid, and rejected withdrawal requests with visual badges. Includes an informational alert explaining that 'Paid' is an administrative record, not automatic payment.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Custom hook managing AI reserve monitoring preference in localStorage, returning a boolean state and setter. Defaults to true (enabled) if no preference is stored.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "React hook that monitors withdrawal requests and displays a toast notification when a request transitions from PENDING to PAID status, ensuring each notification is shown only once per request ID per principal using persistent storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend actor, including user profile management, balance queries, Bitcoin transactions, withdrawal requests, reserve management, and AI lottery operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, featuring warm charcoal backgrounds with amber accents and specialized styles for financial cards and lottery page gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin verification page displaying authenticated admin's principal ID, current balance with USD estimate, and a list of admin capabilities including credit grants, Bitcoin transfers, and withdrawal request management.",
  "frontend/src/pages/AdminPage.tsx": "Comprehensive admin dashboard with tabs for sending BTC, managing reserve deposits/withdrawals, processing user withdrawal requests, monitoring reserve status, and viewing transaction history with real-time status updates.",
  "frontend/src/pages/AiLotteryPage.tsx": "Generates AI-powered lottery number predictions by attempting to fetch historical draw data from data.ny.gov, falling back to a local dataset if unavailable, then producing three lottery outcomes with confidence scores.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Allows users to purchase BTC credits by submitting a Bitcoin mainnet transaction ID and amount for blockchain verification, displaying current balance and USD estimates.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user's BTC balance, recent transactions, Bitcoin wallet address, withdrawal status, and informational alerts about the custodial reserve model and security notices.",
  "frontend/src/pages/HistoryPage.tsx": "Displays comprehensive transaction history with summary statistics (total transactions, credits received, total spent) and a detailed table of all credit purchases, transfers, withdrawals, and adjustments.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system that would allow users to earn BTC credits by solving computational puzzles; currently shows a 'not implemented' alert.",
  "frontend/src/pages/SendBtcPage.tsx": "Handles sending BTC to external Bitcoin mainnet addresses with address validation, network fee estimation, balance checking, and real-time broadcast status polling with detailed transaction lifecycle feedback.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Displays detailed troubleshooting information for a Bitcoin transfer request, including status badges, analysis results, refresh/retry actions, and transaction ID copying. Provides UI for diagnosing stuck or failed transfers with force-fresh checks and retry broadcast functionality.",
  "frontend/src/pages/WithdrawPage.tsx": "Allows users to submit manual withdrawal requests to convert credits to external funds (PayPal, bank transfer, etc.). Displays balance, USD estimates, withdrawal history, and alerts explaining that payouts are processed manually by administrators outside the app.",
  "frontend/src/utils/adminStatusCache.ts": "Provides localStorage-based caching for per-principal admin verification status with 5-minute TTL and in-memory session tracking. Ensures fresh admin checks on new page loads while avoiding redundant backend calls within a session.",
  "frontend/src/utils/errors.ts": "Normalizes backend error messages into user-friendly English text for Send BTC operations and reserve deposit validations. Handles specific error cases like invalid addresses, insufficient funds, broadcast failures, and blockchain verification issues.",
  "frontend/src/utils/fundedNotificationStore.ts": "Manages per-principal localStorage tracking of which withdrawal request IDs have been announced as PAID to prevent duplicate notifications. Provides functions to load, save, check, mark, initialize baseline, and clear notification state.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence for parameters like admin tokens and functions to clear sensitive data from the URL after extraction.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, extended theme settings (fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking architectural decisions, features, and known issues for a Bitcoin credit/wallet system with Internet Identity auth, admin functionality, custodial wallets, blockchain integration via BlockCypher, and Telegram bot interface."
}