{
  "backend/main.mo": "Motoko canister defining user profiles, balances, credit purchases, BTC transfer requests, admin authorization, and blockchain verification logic.",
  "feature_evidence.json": "Empty feature evidence report placeholder containing a 'features' array.",
  "frontend-file-summaries.txt": "Text file listing short summaries for all frontend source files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind base/theme CSS defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React SPA via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with auth gating, admin auto-redirect logic, and initial data refresh behavior.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "UI screen showing admin verification progress with elapsed timer and retry/sign-out actions.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that manages Internet Identity authentication and clears cached admin/query state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name during profile initialization.",
  "frontend/src/components/layout/AppHeader.tsx": "Navigation header showing links, login button, user greeting, and mobile menu with optional admin link.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper including header, main content area, and a footer with attribution.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Renders a table of transactions with type badges, timestamps, amounts, and verify actions, plus an empty-state view.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Dialog for verifying a transfer request by submitting a blockchain transaction ID and displaying request status.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profile, balance, admin status, and transfer-related data using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers plus custom theme variables for light and dark mode, and adds reusable component styles like financial cards and stat text.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Displays verified admin info including principal, balance, and a list of admin capabilities with navigation to the admin panel.",
  "frontend/src/pages/AdminPage.tsx": "Provides admin tools for viewing balance, transferring credits, validating principals, and viewing admin-related transaction history.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Allows users to submit a Bitcoin transaction ID and amount to purchase credits, showing balance and purchase status.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user balance, quick stats, recent transactions, and shortcuts to buy or send BTC.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full transaction history with categorized credit/debit summaries and a detailed transactions table.",
  "frontend/src/pages/SendBtcPage.tsx": "React page for sending BTC that handles input, fee estimation, balance checks, and submitting transfer requests.",
  "frontend/src/utils/adminStatusCache.ts": "Utility for caching per-principal admin status in localStorage with TTL and helpers to get, set, and clear entries.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and removing params from hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, features, and known issues."
}