{
  "backend/main.mo": "Main actor implementing a Bitcoin credit transfer system with balance management, peer transfers, withdrawal requests, transaction history, admin controls, Bitcoin address management, and integration with access control and HTTP outcalls.",
  "backend/migration.mo": "Migration module that transforms old userBitcoinAddresses map into new UserAddressRecord structure supporting multiple addresses, primary address selection, rotation timestamps, and network configuration.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: BitcoinAddressDisplay component updates for rotation, address history view with transaction details, and admin address management capabilities.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and utilities covering authentication, Bitcoin transfers, admin features, address management, and UI styling.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color tokens for light/dark modes, transaction status colors, Segwit address styling, and status badge classes.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, transfers, history, admin pages (including new /admin/addresses route), wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Access denied screen displaying principal ID with copy functionality, session diagnostics showing token and access control status, and retry/navigation options for unauthorized admin access attempts.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Displays a loading screen while verifying admin access, showing elapsed time and offering retry/sign-out actions after 10 seconds. Includes a masked principal display and animated spinner.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard component that checks if the caller is an admin using useIsCallerAdmin hook, showing loading or access denied screens accordingly. Renders children only if user is verified as admin.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a troubleshooting card for non-admin users showing their principal ID with copy functionality and a retry button. Only visible when authenticated user is not an admin.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Full-screen sign-in panel for unauthenticated users with a button to trigger Internet Identity login. Shows loading state during authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggle button for authentication that signs in with Internet Identity or signs out, clearing query cache and admin status on logout. Handles login errors including duplicate authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Non-dismissible until profile is created, with error handling for save failures.",
  "frontend/src/components/balance/AddressHistoryView.tsx": "Displays a sorted list of all user Bitcoin addresses with status badges (Active/Used), copy functionality, and blockchain explorer links. Shows creation dates and address metadata.",
  "frontend/src/components/balance/BitcoinAddressDisplay.tsx": "Card component for displaying and managing the primary Bitcoin address with QR code generation, copy functionality, and address rotation. Shows rotation notices and handles first-time address generation.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays USD value estimate for a BTC amount based on current price, with loading skeleton and disclaimer. Shows unavailable state when price data is missing.",
  "frontend/src/components/buybtc/BuyBitcoinHistoryTable.tsx": "Displays a table of Bitcoin purchase history with transaction details, amounts in BTC/USD, verification dates, and actions to copy txid or view on blockchain explorer.",
  "frontend/src/components/buybtc/InstantFundingForm.tsx": "Form component for recording Bitcoin purchases by entering a transaction ID and amount, with validation, instant balance crediting, and success feedback.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with title and login/logout button that manages Internet Identity authentication state.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing navigation menu with links to dashboard, send/receive BTC, buy/withdraw, history, peer transfers, AI lottery, and admin sections (with conditional admin-only routes).",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues via Internet Computer HTTP outcalls.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Placeholder card for reserve status monitoring that displays unavailable status and suggests using external Bitcoin Core RPC or blockchain explorers.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "Collapsible card displaying a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that it must be executed externally and copy-to-clipboard functionality.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Collapsible card component that displays a Python code snippet for monitoring mining pool earnings and transferring BTC to a reserve wallet, with warnings that the script must be run externally and not within the app.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "Card component for configuring multisig reserve settings (threshold, public keys, address, redeem script) with a warning that backend implementation is not yet complete.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "Collapsible card component that displays Python code for creating a Bitcoin Core multisig reserve address, with warnings that the script must be executed externally on a machine with Bitcoin Core access.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Exports structured best practices documentation covering backend implementation issues, HTTP outcall failures, and localhost connectivity problems with resolutions and workarounds.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "Searchable and filterable component that displays best practices for Bitcoin transfers, with auto-suggested topics based on transfer failure patterns and error contexts.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Collapsible alert component explaining how the app broadcasts Bitcoin transactions via IC HTTP outcalls to public APIs, emphasizing that private keys must never be entered and signing must be done externally.",
  "frontend/src/components/transfers/MainnetTransactionAlert.tsx": "Alert component displaying important information about mainnet Bitcoin transactions including irreversibility, reserve-funded fees, confirmation times, and Segwit support.",
  "frontend/src/components/transfers/ProviderDiagnosticsCard.tsx": "Displays detailed diagnostics for blockchain API provider broadcast attempts, showing success/failure status, HTTP responses, and error messages in a collapsible card format.",
  "frontend/src/components/transfers/SegwitTransactionDetails.tsx": "Shows Bitcoin transaction details including destination address, amount, estimated fee, and transaction hash with copy-to-clipboard functionality and mainnet warning.",
  "frontend/src/components/transfers/TransactionConfirmationProgress.tsx": "Displays real-time blockchain confirmation progress for Bitcoin transactions with a progress bar, polling for updates, and estimated time remaining until 6 confirmations.",
  "frontend/src/components/transfers/TransactionStatusBadge.tsx": "Renders status badges for Bitcoin transactions based on signing status, broadcast status, and confirmation count with appropriate icons and colors.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a table of transaction history with expandable rows showing mainnet transaction details, confirmation progress, and segwit information for applicable transactions.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Empty file with no content.",
  "frontend/src/components/verification/AdminVerificationRequestsTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/ManualVerificationForm.tsx": "Form component for manually recording Bitcoin purchases with transaction ID and amount validation. Validates 64-character hex txids and BTC amounts up to 8 decimal places, converts to satoshis, and submits via useRecordBitcoinPurchase hook.",
  "frontend/src/components/verification/UserVerificationHistoryTable.tsx": "Empty file with no content.",
  "frontend/src/components/verification/VerificationHistoryTable.tsx": "Table component displaying Bitcoin purchase verification history with transaction IDs, amounts, timestamps, and verifier principals. Includes copy-to-clipboard and external blockchain explorer links, sorted by verification date descending.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Admin table component for managing withdrawal requests with filtering by status (pending/paid/rejected), sortable columns, and action handlers for approve/reject/mark-paid operations. Includes status badges and clipboard copy functionality.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Admin dashboard displaying withdrawal request statistics (pending/paid/rejected counts) and a table for processing requests. Includes manual processing alert and handlers for marking requests as paid or rejected.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component providing code examples for integrating external payout APIs (PayPal OAuth/Payouts and Stripe manual payouts). Includes copy-to-clipboard functionality for code snippets.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Displays a filterable list of withdrawal requests with tabs for ALL/PENDING/PAID/REJECTED statuses. Shows withdrawal details including amount in BTC, method, account, and timestamps with color-coded status badges.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Card component showing a summary count of withdrawal requests by status (pending/paid/rejected). Includes a link to request new withdrawals and displays a disclaimer about administrative audit records.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication. Handles identity-based actor creation, admin token initialization, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Custom hook managing AI reserve monitoring preference in localStorage. Returns a boolean state and setter, defaulting to true (enabled) if no preference exists.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Polls withdrawal requests every 30 seconds and displays toast notifications when requests transition to PAID status. Uses a notification store to prevent duplicate alerts and initializes a baseline on first load.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management. Includes a provider component and hook for accessing authentication status and identity throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, transactions, withdrawals, peer transfers, and Bitcoin purchases. Includes mutations for saving profiles and creating various transaction types with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm amber/charcoal color scheme for light and dark modes. Includes transaction status color classes and financial UI component styles using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminAddressManagementPage.tsx": "Admin page displaying all user Bitcoin addresses with search functionality, statistics (total/active/used addresses), and a table showing address details with copy-to-clipboard and blockchain explorer links.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin credentials page showing the administrator's principal ID, account balance in BTC with USD estimate, admin status verification, and a list of admin capabilities.",
  "frontend/src/pages/AdminManualVerificationPage.tsx": "Admin page for manually recording Bitcoin purchases with a form for entering transaction IDs and amounts, plus a verification history table; includes an alert noting instant funding is now the standard flow.",
  "frontend/src/pages/AdminPage.tsx": "Main admin dashboard showing overview cards for pending withdrawals, recent transactions, and reserve status, with navigation links to withdrawal management, peer transfers, manual verification, and other admin tools.",
  "frontend/src/pages/AdminPeerTransfersPage.tsx": "Admin page for monitoring peer-to-peer credit transfers with status filtering (pending/approved/rejected), statistics cards, and a sortable table displaying transfer details with copy-to-clipboard functionality.",
  "frontend/src/pages/AdminSendCreditsPage.tsx": "Admin form page for crediting BTC directly to user accounts by entering principal ID, transaction ID, and amount, with validation and USD estimate display.",
  "frontend/src/pages/AdminSendToUserPage.tsx": "Admin page for searching and selecting users from the system to send BTC credits to them, with confirmation dialog and transaction history display.",
  "frontend/src/pages/AdminVerificationRequestsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/AiLotteryPage.tsx": "Page that generates AI-predicted lottery numbers (Powerball) by attempting to fetch historical draw data from data.ny.gov or using fallback data, displaying 3 outcomes with confidence scores.",
  "frontend/src/pages/BuyBitcoinPage.tsx": "Page for submitting external Bitcoin purchase transactions for instant account funding, displaying current balance and purchase history.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Placeholder page showing current BTC balance and explaining that credit purchase payment integration is under development.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user's BTC balance, Bitcoin address, custodial model warning, and navigation cards for send/receive/withdraw/buy operations with withdrawal status summary.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page showing summary statistics (total transactions, credits received/spent, mainnet transaction status) and a detailed transaction table with auto-open support for specific transfer requests.",
  "frontend/src/pages/IncomingRequestsPage.tsx": "Displays a list of approved peer-to-peer credit transfers received by the current user, showing sender details, amounts in BTC, and timestamps with copy-to-clipboard functionality.",
  "frontend/src/pages/OutgoingRequestsPage.tsx": "Shows all peer-to-peer credit transfers sent by the current user with status badges (approved/pending/rejected), recipient details, and a link to initiate new transfers if none exist.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system that displays an alert indicating the feature is not yet implemented in the backend.",
  "frontend/src/pages/ReceiveBtcPage.tsx": "Provides UI for receiving Bitcoin with tabs for active address display (QR code and address) and address history, including instructional alerts about transaction confirmations and Segwit addresses.",
  "frontend/src/pages/SendBtcPage.tsx": "Form page for sending Bitcoin to external addresses with validation for Segwit addresses, balance checks, transaction broadcasting with provider diagnostics, and confirmation progress tracking.",
  "frontend/src/pages/SendToPeerPage.tsx": "Enables internal peer-to-peer credit transfers by validating recipient Principal IDs, checking balances, and showing a confirmation dialog before executing the transfer.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Troubleshooting documentation page that explains the missing sendBTC backend method, displays error details, and provides best practices guidance for when the feature is implemented.",
  "frontend/src/pages/UserVerifyTransactionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/WithdrawPage.tsx": "React component for user withdrawal requests, allowing users to submit BTC withdrawal requests via PayPal or Stripe, displaying submission confirmation, and showing withdrawal history with funded withdrawal notifications.",
  "frontend/src/types/mainnet.ts": "TypeScript type definitions for mainnet Bitcoin transactions, including signing/broadcast status enums, extended transaction interfaces with confirmation tracking, and result types for sendBTC operations and confirmation analysis.",
  "frontend/src/utils/adminStatusCache.ts": "Per-principal admin status caching utility using localStorage with 5-minute TTL and in-memory session tracking to ensure fresh admin verification checks on new page loads.",
  "frontend/src/utils/errors.ts": "Error normalization utility that converts various error formats into user-friendly messages, with specific handling for backend method missing errors, Bitcoin transaction errors, HTTP outcall failures, and blockchain provider issues.",
  "frontend/src/utils/fundedNotificationStore.ts": "Per-principal localStorage-backed store for tracking which withdrawal request IDs have been announced as PAID to prevent duplicate notifications, with baseline initialization and state management functions.",
  "frontend/src/utils/transactionStatus.ts": "Utility functions for Bitcoin transaction status management including status message generation, confirmation time estimation, progress calculation, Segwit address validation, and polling determination based on transaction state.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing and management utilities supporting both hash-based and browser-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with Inter and JetBrains Mono fonts, container queries, animations for accordions, and custom shadows for a financial UI theme.",
  "project_state.json": "Project state tracking document for a Bitcoin Credit Transfer application, listing existing features for address display/rotation and history views, plus pending feature requests for implementing a comprehensive Bitcoin address management framework with lifecycle operations, validation, and transaction integration."
}