{
  "backend/main.mo": "Defines core actor state, types, and data structures for BTC pricing, balances, transfers, withdrawals, reserve management, and admin authorization.",
  "feature_evidence.json": "Lists implemented feature reports linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files covering routing, UI components, hooks, and pages.",
  "frontend/index.css": "Sets global Tailwind base styles and light/dark OKLCH color tokens for the frontend.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application setup with routing, authentication gate, admin guard, layout, and page registration.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI screen shown when a user lacks admin privileges, with principal display, diagnostics, and retry options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen for admin verification with elapsed timer, masked principal display, and retry/sign‑out actions.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Shows a warning card when a logged‑in user is not an admin, allowing them to copy their principal ID and retry the admin check.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Displays a centered login panel prompting users to sign in with Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign‑in/sign‑out button handling Internet Identity auth, session clearing, and admin cache reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name during initial profile setup.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays an estimated USD value for a BTC amount or a loading/unavailable state.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation, login button, admin access check, and user greeting, supporting mobile and desktop layouts.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, admin troubleshooting card injection, page content area, and footer.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible admin card explaining Bitcoin broadcast behavior and showing best‑practice guidance.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "Admin panel polling and displaying reserve status, readiness checks, errors, and manual refresh controls.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "UI card showing a collapsible Python snippet for querying Bitcoin Core wallet balances, with alerts noting it must run externally and a copy-to-clipboard feature.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "Displays an external Python monitoring script for mining pool earnings with warnings, collapsible UI, and copy-to-clipboard support.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "Form-driven panel that loads, edits, and saves multisig configuration metadata, including threshold, pubkeys, address, and redeem script.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "Shows a collapsible Python snippet for creating a multisig on Bitcoin Core, emphasizing it must run externally and allowing code copying.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Provides structured best‑practice entries explaining common connectivity, provider, mempool, and network issues.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "Searchable and categorized best‑practices viewer that suggests relevant troubleshooting entries and renders them in an accordion.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "Collapsible UI note explaining how the app broadcasts Bitcoin transactions and warning users not to provide private keys.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Displays a sortable table of past transactions with type, date, amount, and actions including opening a verification dialog.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Dialog showing live status details for a transfer request with copy, refresh, and troubleshooting actions.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Admin table for viewing, approving, or rejecting withdrawal requests with copy and dialog controls.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Displays admin-level counts of pending, paid, and rejected withdrawal requests with styled status cards and conditional prompts.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Provides collapsible developer notes with copyable code snippets for PayPal and Stripe payout API integrations.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "Renders a sortable table of withdrawal requests with formatted timestamps, status badges, and method details.",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Shows a user-facing summary of pending, paid, and rejected withdrawals, including guidance on what 'Paid' means.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Stores and syncs a boolean AI reserve monitoring preference using localStorage.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Monitors withdrawal status changes and triggers a toast when a request transitions from pending to paid.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, including login, logout, and identity loading from storage.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks to fetch and mutate user profile, balances, BTC operations, and reserve-related data.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, themes, and component utility classes including custom gradients and layout helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing React Query and wrapping the app with the InternetIdentityProvider.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin page displaying principal ID, balance with USD estimate, and a list of admin permissions.",
  "frontend/src/pages/AdminPage.tsx": "Comprehensive admin dashboard for managing BTC transfers, reserves, withdrawals, and monitoring system status.",
  "frontend/src/pages/AiLotteryPage.tsx": "Generates lottery number outcomes using recent draw data or a fallback dataset and displays results with status alerts.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Provides a form to submit Bitcoin transaction IDs to purchase credits and shows current balance with USD estimates.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user balance, wallet info, recent transactions, and security notices with BTC/USD estimates.",
  "frontend/src/pages/HistoryPage.tsx": "Shows full transaction history with totals and optionally highlights a specific transfer using session-stored request IDs.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Presents placeholder UI for an upcoming puzzle rewards system with a notice that the feature is not yet implemented.",
  "frontend/src/pages/SendBtcPage.tsx": "Allows sending BTC credits, calculates fees, submits transfer requests, and shows success or failure outcomes with navigation options.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "UI page for inspecting and troubleshooting a specific BTC transfer request, including refreshing status, forcing re-analysis, and retrying broadcast.",
  "frontend/src/pages/WithdrawPage.tsx": "Withdrawal form and history page allowing users to submit manual payout requests and view past requests, with balance checks and notifications.",
  "frontend/src/utils/adminStatusCache.ts": "LocalStorage-based cache for storing per‑principal admin status with TTL and in‑memory verification tracking.",
  "frontend/src/utils/errors.ts": "Functions that convert backend error messages into clearer, user‑friendly text for BTC transfers and reserve deposit validation.",
  "frontend/src/utils/fundedNotificationStore.ts": "LocalStorage-backed store that tracks which withdrawal requests have already triggered PAID notifications for a principal.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, requirements, architectural notes, and known issues for BTC-credit handling, admin flows, and blockchain integration."
}