{
  "backend/main.mo": "Main Motoko actor defining state, types, and logic for BTC-backed credit balances, transfers, user profiles, reserve tracking, and admin authorization.",
  "backend/migration.mo": "Migration module converting old SendBTCRequest records to include the new diagnosticData field while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and functionality for planning.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and light/dark theme tokens for global styling.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React router and authentication gate handling routing, admin verification, profile setup, and global layout.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI screen shown when a user's principal is not recognized as admin, displaying diagnostics, copy action, and retry/sign‑out options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Loading screen that verifies admin access, showing elapsed time and exposing retry/sign‑out actions after a delay.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Troubleshooting card shown to non-admin authenticated users, allowing copying the principal ID and retrying the admin check.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout and clearing related caches.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name during profile setup.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with navigation, profile display, login button, and conditional admin link.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper including header, admin troubleshooting card, content area, and footer.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "Table displaying transaction history with formatted details and a dialog for verifying selected transfers.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "Dialog component for verifying and confirming BTC transfer requests, showing status and handling transaction ID submission.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading and managing user identities and login state through Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, wallets, balances, admin checks, and BTC transfers.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, and common UI utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin page displaying principal ID, balance, and available admin capabilities with navigation to the admin panel.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for managing balances, transferring credits, sending BTC, and handling reserve actions with validation and status displays.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Page for users to submit Bitcoin transaction IDs to purchase credits and view current credit balance.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing balance, USD estimate, wallet info, and recent transactions with copy-to-clipboard support.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full transaction history with summaries of credits, debits, and auto-opening of specific transfer requests.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Allows users to solve puzzles for credit rewards, view available puzzles, and see their BTC-denominated balance.",
  "frontend/src/pages/SendBtcPage.tsx": "React page for sending BTC that handles input, fee estimation, balance checks, submitting on-chain transfer requests, and showing success/failure results.",
  "frontend/src/utils/adminStatusCache.ts": "Provides a TTL-based localStorage cache for per-principal admin status with in-memory tracking for current page-load verification.",
  "frontend/src/utils/errors.ts": "Normalizes backend Send BTC errors into clear user-facing messages, covering address issues, insufficient funds, and broadcast failures.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using both query strings and hash routing with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout with custom theme variables and plugins.",
  "project_state.json": "Project state description including BTC-backed credit model, admin flow, custodial wallet design, and known issues with broadcast failures."
}