{
  "backend/main.mo": "Main backend actor implementing Bitcoin credit transfer system with balance management, transaction history, withdrawal requests, peer transfers, verification requests, access control, and Bitcoin price tracking with HTTP outcalls.",
  "backend/migration.mo": "Migration module defining the Actor type with all state fields (BTC price, balances, configs, counters) and a run function that currently performs no-op migration.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing username save in ProfileSetupModal and adding error handling/user feedback for profile creation failures.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and styling, with detailed descriptions of ProfileSetupModal's error handling and useSaveCallerUserProfile mutation implementation.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color tokens for light/dark modes, transaction status colors, and custom styling for Segwit addresses and status badges.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitcoin Credit Transfer application.",
  "frontend/src/App.tsx": "Root application component configuring React Router with all routes (dashboard, admin, transfers, withdrawals, verification), QueryClient provider, theme provider, and ProfileSetupModal integration.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial screen displaying principal ID with copy functionality, session diagnostics showing token and access control status, and retry/sign-out/home navigation options.",
  "frontend/src/components/auth/AdminAccessLoadingScreen.tsx": "Displays a loading screen while verifying admin access, showing elapsed time and offering retry/sign-out actions after 10 seconds. Masks the principal ID for privacy.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard component that checks if the caller is an admin using useIsCallerAdmin hook, showing loading or access denied screens accordingly before rendering children.",
  "frontend/src/components/auth/AdminTroubleshootingCard.tsx": "Displays a warning card for authenticated non-admin users, showing their principal ID with copy functionality and a retry button for re-checking admin status.",
  "frontend/src/components/auth/LoggedOutSignInPanel.tsx": "Full-screen sign-in panel for unauthenticated users with a button to initiate Internet Identity login.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggle button for signing in/out with Internet Identity, clearing query cache and admin status on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, creating a UserProfile object on submission.",
  "frontend/src/components/balance/UsdEstimateLine.tsx": "Displays estimated USD value for a BTC amount using current price, with loading state and disclaimer about market fluctuations.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with title and login/logout button, handling authentication state and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with header, navigation menu (showing admin links conditionally), main content area, and footer with Caffeine.ai attribution.",
  "frontend/src/components/reserve/AdminBroadcastTroubleshootingCard.tsx": "Collapsible card providing troubleshooting guidance and best practices for Bitcoin transaction broadcasting issues, embedding a BestPracticesSection component.",
  "frontend/src/components/reserve/AdminReserveStatusMonitor.tsx": "A placeholder UI component that displays a non-functional reserve status monitor with alerts indicating that backend capabilities for monitoring Bitcoin reserve balance and health are not currently available.",
  "frontend/src/components/reserve/BitcoinCoreReserveBalanceExternalNote.tsx": "A collapsible card component that displays a Python code snippet for querying Bitcoin Core node balance via RPC, with warnings that this script must be executed externally since the IC canister cannot run Python or connect to localhost.",
  "frontend/src/components/reserve/ExternalAiReserveManagerMiningPoolNote.tsx": "A collapsible card component showing a Python script example for monitoring mining pool earnings and automating reserve transfers, with alerts emphasizing that this must be run externally and not within the app.",
  "frontend/src/components/reserve/ReserveMultisigConfigPanel.tsx": "A configuration panel UI for viewing and updating multisig reserve settings (threshold, public keys, address, redeem script) with an alert noting that backend implementation is not yet complete.",
  "frontend/src/components/reserve/ReserveMultisigSetupExternalNote.tsx": "A collapsible card displaying Python code for creating Bitcoin multisig addresses via Bitcoin Core RPC, with warnings that this must be executed externally and results should be saved in the configuration panel.",
  "frontend/src/components/transfers/bestPracticesContent.ts": "Defines a BestPracticeEntry interface and exports an array of troubleshooting guides for common Bitcoin transfer issues (localhost connectivity, provider timeouts, mempool congestion, wrong network). Each entry includes category, keywords, and detailed problem/solution descriptions.",
  "frontend/src/components/transfers/BestPracticesSection.tsx": "A searchable and filterable troubleshooting guide component that displays best practices for Bitcoin transfers, with auto-suggestion of relevant topics based on transfer failure patterns from request data.",
  "frontend/src/components/transfers/BroadcastingDetailsNote.tsx": "A collapsible alert component that explains how Bitcoin transaction broadcasting works, emphasizing that the app uses IC HTTP outcalls to broadcast pre-signed transactions and never handles private keys.",
  "frontend/src/components/transfers/MainnetTransactionAlert.tsx": "An alert component displaying important mainnet transaction information including irreversibility, reserve-funded fees, confirmation times, and Segwit support.",
  "frontend/src/components/transfers/ProviderDiagnosticsCard.tsx": "A placeholder card component for displaying blockchain provider diagnostics, currently showing a stub message until backend implements actual HTTP outcalls to blockchain APIs.",
  "frontend/src/components/transfers/SegwitTransactionDetails.tsx": "A card component displaying detailed Segwit transaction information including destination address, amount, estimated fee, Segwit address type, and transaction hash with copy-to-clipboard functionality.",
  "frontend/src/components/transfers/TransactionConfirmationProgress.tsx": "A card component showing transaction confirmation progress with a progress bar, confirmation count, estimated time remaining, and a link to view the transaction on Blockstream.",
  "frontend/src/components/transfers/TransactionStatusBadge.tsx": "A badge component that displays the current status of a transaction based on signing status, broadcast status, and confirmation count with appropriate icons and colors.",
  "frontend/src/components/transfers/TransferHistoryTable.tsx": "A table component displaying transaction history with expandable rows that show detailed mainnet transaction information including status badges, Segwit details, and confirmation progress.",
  "frontend/src/components/transfers/VerifyTransferDialog.tsx": "File content was truncated, but appears to be a dialog component for verifying transfer details before submission.",
  "frontend/src/components/verification/AdminVerificationRequestsTable.tsx": "React component displaying a table of verification requests for admins with filtering, sorting, and actions to approve/reject requests. Includes a dialog for rejection with required comments and displays request details like transaction ID, amount, status badges, and timestamps.",
  "frontend/src/components/verification/ManualVerificationForm.tsx": "React form component for manually recording Bitcoin purchases with validation for transaction ID (64-char hex) and amount (BTC with up to 8 decimals). Converts BTC to satoshis and submits via useRecordBitcoinPurchase hook.",
  "frontend/src/components/verification/UserVerificationHistoryTable.tsx": "React component displaying a user's verification request history in a table with columns for request ID, transaction ID, amount, submission date, status badges, and admin comments. Includes copy-to-clipboard and blockchain explorer links.",
  "frontend/src/components/verification/VerificationHistoryTable.tsx": "React component showing a table of verified Bitcoin purchase records with transaction ID, amount in BTC, verification date, and verifier principal. Includes copy-to-clipboard functionality and blockchain explorer links for each transaction.",
  "frontend/src/components/withdrawals/AdminWithdrawalRequestsTable.tsx": "Displays a sortable, filterable table of withdrawal requests for admins with tabs for pending/paid/rejected/all statuses and action buttons to approve, reject, or mark as paid.",
  "frontend/src/components/withdrawals/AdminWithdrawalStatusDashboard.tsx": "Admin dashboard showing withdrawal request statistics (pending/paid/rejected counts) with an alert about manual payment processing and the AdminWithdrawalRequestsTable component.",
  "frontend/src/components/withdrawals/ExternalPayoutApisDeveloperNote.tsx": "Collapsible developer reference component displaying code examples for integrating PayPal and Stripe payout APIs with copy-to-clipboard functionality.",
  "frontend/src/components/withdrawals/WithdrawalHistoryList.tsx": "User-facing component that displays a filterable list of the caller's withdrawal requests organized by status tabs (all/pending/paid/rejected).",
  "frontend/src/components/withdrawals/WithdrawalStatusSummaryCard.tsx": "Card component showing a summary of user's withdrawal requests with counts by status and a link to request new withdrawals.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAiReserveMonitoringPreference.ts": "Hook managing AI reserve monitoring preference in localStorage, returning a boolean state and setter with a default value of true.",
  "frontend/src/hooks/useFundedWithdrawalNotifications.ts": "Hook that polls for withdrawal requests every 30 seconds and displays toast notifications when requests are marked as paid, tracking notification state to avoid duplicates.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, transactions, admin status, balances, withdrawal requests, peer transfers, verification requests, and Bitcoin purchases with automatic refetching for pending transactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, including warm amber accents, transaction status colors, and financial UI component styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminCredentialsPage.tsx": "Admin page displaying administrator status, principal ID with copy functionality, account balance with USD estimate, and a list of admin capabilities.",
  "frontend/src/pages/AdminManualVerificationPage.tsx": "Admin page for manually verifying Bitcoin purchases by recording transaction IDs and amounts, with a form for new verifications and a history table of past records.",
  "frontend/src/pages/AdminPage.tsx": "Main admin dashboard showing overview cards for pending withdrawals, transactions, and reserve status, with navigation links to withdrawal management, peer transfers, verification, manual verification, reserve management, and credentials pages.",
  "frontend/src/pages/AdminPeerTransfersPage.tsx": "Admin page for viewing and monitoring all peer-to-peer credit transfers with status filtering (pending/approved/rejected/deleted), summary statistics cards, and a sortable table displaying transfer details with copy-to-clipboard functionality.",
  "frontend/src/pages/AdminSendCreditsPage.tsx": "Admin page for directly crediting BTC to user accounts by entering a Principal ID and amount, with validation for Principal format and BTC amount (max 8 decimals), plus USD estimate display.",
  "frontend/src/pages/AdminSendToUserPage.tsx": "Admin page for sending BTC credits to users with a searchable user list, user selection interface, amount input with validation, and a confirmation dialog before executing the transfer.",
  "frontend/src/pages/AdminVerificationRequestsPage.tsx": "Admin page for reviewing and processing user-submitted Bitcoin transaction verification requests, displaying summary statistics and a table with approve/reject actions for each pending verification.",
  "frontend/src/pages/AiLotteryPage.tsx": "Lottery number generator page that attempts to fetch historical draw data from data.ny.gov, falls back to local dataset on failure, and generates three lottery outcomes mixing recent winners with other numbers plus AI confidence scores.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Placeholder page for purchasing BTC credits showing current balance and USD estimate, with informational content about the upcoming payment integration feature that is currently under development.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user's Bitcoin balance, withdrawal status summary, and quick action cards for sending BTC, peer transfers, withdrawals, and viewing history. Includes a custodial wallet warning alert and uses hooks for balance and transaction data.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays all user transactions with summary statistics (total transactions, credits received/spent, mainnet transaction statuses) and a detailed transaction table. Supports auto-opening specific transfer requests via session storage.",
  "frontend/src/pages/IncomingRequestsPage.tsx": "Displays approved peer-to-peer transfers received by the current user, showing transfer amounts, sender principals, and timestamps with copy-to-clipboard functionality.",
  "frontend/src/pages/OutgoingRequestsPage.tsx": "Shows all peer-to-peer transfers sent by the current user with status badges (approved/pending/rejected), sorted by creation date, and includes recipient information with copy functionality.",
  "frontend/src/pages/PuzzleRewardsPage.tsx": "Placeholder page for a puzzle rewards system feature that is not yet implemented in the backend, displaying an informational alert about future availability.",
  "frontend/src/pages/SendBtcPage.tsx": "Form page for sending Bitcoin to external addresses, featuring destination and amount inputs, transaction status tracking, mainnet transaction alerts, security warnings about custodial model, and error handling with normalized error messages.",
  "frontend/src/pages/SendToPeerPage.tsx": "Page component for peer-to-peer credit transfers, allowing users to send BTC credits to another user by principal ID with validation, confirmation dialog, and balance display.",
  "frontend/src/pages/TransferTroubleshootingPage.tsx": "Troubleshooting guide page for mainnet Bitcoin transactions, providing diagnostics for signing issues, broadcasting problems, and best practices for Segwit transactions.",
  "frontend/src/pages/UserVerifyTransactionPage.tsx": "User-facing page for submitting Bitcoin transactions for admin verification, with form validation for txid and amount, plus a history table of verification requests.",
  "frontend/src/pages/WithdrawPage.tsx": "Withdrawal request page allowing users to request PayPal or Stripe payouts, displays balance, handles form submission, and shows withdrawal history with success confirmation.",
  "frontend/src/types/mainnet.ts": "TypeScript type definitions for mainnet Bitcoin transactions including signing/broadcast status enums, extended transaction interface, and result types for BTC operations.",
  "frontend/src/utils/adminStatusCache.ts": "Utility for caching admin status per principal in localStorage with 5-minute TTL and session-based verification tracking to ensure fresh checks on new page loads.",
  "frontend/src/utils/errors.ts": "Normalizes Bitcoin transaction errors into user-friendly messages, handling blockchain API rejections, network failures, rate limits, address validation, insufficient balance, and mempool issues.",
  "frontend/src/utils/fundedNotificationStore.ts": "Per-principal localStorage utility for tracking which withdrawal request IDs have been notified as PAID to prevent duplicate notifications, with baseline initialization support.",
  "frontend/src/utils/transactionStatus.ts": "Utility functions for Bitcoin transaction status determination, formatting status messages, calculating confirmation times, validating Segwit addresses, and formatting satoshi amounts.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, container queries, animations, and financial-themed design tokens.",
  "project_state.json": "Project state tracking document indicating a P2P transfer app with an active fix request for username persistence issues in profile creation."
}