{
  "kind": "build_request",
  "title": "Fix username not persisting during profile creation",
  "projectName": "Bitcoin Credit Transfer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the issue where the username entered in the ProfileSetupModal is not being saved when the user clicks the save button. Verify that the createProfile mutation is being called correctly and that the backend is persisting the username.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "User name isn't going past save point to create profile please troubleshoot issue"
        ]
      },
      "acceptanceCriteria": [
        "Username entered in ProfileSetupModal successfully persists to the backend",
        "Profile creation completes without errors",
        "User can proceed past the profile setup modal after entering a valid username",
        "Backend returns the created profile with the correct username"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add error handling and user feedback in ProfileSetupModal to display any errors that occur during profile creation, including network errors, validation errors, or backend failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "ProfileSetupModal displays error messages if profile creation fails",
        "User receives clear feedback about what went wrong",
        "Modal shows loading state while profile is being created",
        "User can retry profile creation if an error occurs"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify that the backend createProfile method correctly validates and stores the username, and returns appropriate error responses for invalid inputs or system failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "Backend validates username is not empty and meets any length requirements",
        "Profile is correctly stored with the principal and username",
        "Backend returns success response with created profile data",
        "Backend returns descriptive error messages for validation failures"
      ]
    }
  ],
  "constraints": [
    "Do not modify the useInternetIdentity hook or authentication flow",
    "Maintain single-actor architecture in backend/main.mo",
    "Do not change the ProfileSetupModal component structure, only fix the save logic"
  ],
  "nonGoals": [
    "Adding additional profile fields beyond username",
    "Implementing profile editing functionality",
    "Changing the authentication system"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}