{
  "kind": "build_request",
  "title": "Add visible Internet Identity login button on mobile login screen",
  "projectName": "BTC Credits",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-173",
      "text": "Update the unauthenticated (logged-out) screen so it renders a visible, tappable sign-in button that triggers the existing Internet Identity login flow, instead of showing only the \"Please log in to access the application\" message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add button"
        ]
      },
      "acceptanceCriteria": [
        "When the user is not authenticated, the page shows a prominent button that can be tapped on mobile (no text-only login state).",
        "Tapping the button starts the Internet Identity login flow (same behavior as the existing header LoginButton).",
        "The existing logged-out message (or equivalent) remains visible along with the button so users understand why they are being asked to sign in."
      ]
    },
    {
      "id": "REQ-174",
      "text": "Ensure the sign-in button’s label explicitly says \"Sign in with Internet Identity\" on the logged-out screen so users understand what provider they are using.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Stuck at login no login button appears for app",
          "From phone just a message saying login app but no button to login appears",
          "Add button"
        ]
      },
      "acceptanceCriteria": [
        "On the logged-out screen, the primary button text is \"Sign in with Internet Identity\" (English).",
        "No user-facing login text implies an invisible/automatic login; the user can always see what to tap."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all user-facing text in clear English."
  ],
  "nonGoals": [
    "Do not change backend authentication logic or admin allowlist behavior.",
    "Do not add new authentication providers; Internet Identity remains the only login method."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}