{
  "kind": "build_request",
  "title": "Add 1:1 BTC Reserve Backing Model and Admin Reserve Monitoring",
  "projectName": "Reserve BTC Credits",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-88",
      "text": "Implement a backend BTC reserve-tracking model so that issued credits are represented as being backed 1:1 by mainnet BTC held in reserve, and expose a backend query that returns reserve status including: reserve BTC balance, total outstanding issued credits, and a reserve coverage ratio.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes set reserve and with bot that backs credit transfer to mainnet wallet bitcoin. Each credit on app has market value of mainnet bitcoin."
        ]
      },
      "acceptanceCriteria": [
        "A new backend query method exists that returns reserve status fields: reserve BTC balance, outstanding credits, and coverage ratio (reserve/outstanding).",
        "Reserve status can be fetched without trapping for authorized callers (admin-only is acceptable).",
        "Outstanding credits are computed deterministically from backend state (not a frontend calculation)."
      ]
    },
    {
      "id": "REQ-89",
      "text": "Update backend accounting so reserve status updates automatically during credit lifecycle events: (1) when a credit purchase is successfully verified and credits are issued, increase tracked reserve by the issued amount; (2) when an on-chain BTC transfer is successfully broadcast, decrease tracked reserve by the on-chain spend amount (receiver amount plus network fee); (3) when an on-chain broadcast fails and the transfer request is marked FAILED and credits are restored, do not decrement reserve.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes set reserve and with bot that backs credit transfer to mainnet wallet bitcoin. Each credit on app has market value of mainnet bitcoin."
        ]
      },
      "acceptanceCriteria": [
        "After a successful credit purchase, reserve BTC balance increases by the same amount of credits issued.",
        "After a broadcast-successful send, reserve BTC balance decreases by (amount + networkFee) recorded on the transfer request.",
        "After a broadcast failure (FAILED) where credits are restored, reserve BTC balance is unchanged compared to pre-send state.",
        "Reserve changes are consistent across retries/page refreshes (no double-counting for the same request)."
      ]
    },
    {
      "id": "REQ-90",
      "text": "Add backend enforcement for the 1:1 reserve claim by preventing issuance of new credits if it would cause outstanding credits to exceed tracked reserve coverage, unless an admin explicitly overrides via an admin-only reserve management action.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes set reserve and with bot that backs credit transfer to mainnet wallet bitcoin. Each credit on app has market value of mainnet bitcoin."
        ]
      },
      "acceptanceCriteria": [
        "If issuing credits would result in outstanding credits > tracked reserve, the purchase/issuance operation fails with a clear English error message.",
        "An admin-only backend method exists to adjust the tracked reserve balance (increase/decrease) with an English reason string for audit purposes.",
        "All admin reserve adjustments are recorded in an auditable backend history (can be a dedicated reserve log or reuse an existing transaction-style record, but must be queryable)."
      ]
    },
    {
      "id": "REQ-91",
      "text": "Add an admin-visible Reserve section in the existing Admin page that displays reserve BTC balance, outstanding credits, and reserve coverage ratio, and includes a simple admin-only control to adjust the tracked reserve balance with a required English reason.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes set reserve and with bot that backs credit transfer to mainnet wallet bitcoin. Each credit on app has market value of mainnet bitcoin."
        ]
      },
      "acceptanceCriteria": [
        "Admins can see reserve BTC balance, outstanding credits, and coverage ratio on `/admin`.",
        "Admins can submit a reserve adjustment amount and a required reason; on success, the reserve status display updates.",
        "Non-admin users cannot access the reserve management UI (it should not render for them).",
        "All user-facing text in this section is in English."
      ]
    },
    {
      "id": "REQ-92",
      "text": "Update user-facing copy in the signed-in experience to clearly state that credits are BTC-denominated, represent 1:1 backing by BTC held in reserve, and that the USD market value fluctuates with the Bitcoin market price.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Each credit on app has market value of mainnet bitcoin."
        ]
      },
      "acceptanceCriteria": [
        "Dashboard (or another signed-in screen) includes English text that states: 1 credit = 1 BTC, credits are backed 1:1 by BTC held in reserve, and USD value fluctuates with market price.",
        "No existing copy contradicts the 1:1 reserve statement.",
        "No blue/purple theme changes are introduced as part of this request (copy-only change is acceptable)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Do not edit files under `frontend/src/components/ui` or other paths listed in `frontend.immutablePaths`; compose existing components instead.",
    "Use English for all user-facing text.",
    "Do not add Python/Telegram/third-party bot services; any “bot” behavior must be implemented within the existing IC app constraints (backend automation + existing outcall approach where applicable)."
  ],
  "nonGoals": [
    "Implementing external Telegram bot commands or a separate off-chain service.",
    "Adding external databases or non-IC backend infrastructure.",
    "Implementing real-time updates via WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}