{
  "kind": "build_request",
  "title": "Implement Bitcoin address generation and transaction signing framework",
  "projectName": "Bitcoin Transfer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend framework for generating Bitcoin P2WPKH (Segwit) addresses. Add a backend method that generates a valid Bitcoin receiving address for authenticated users, ensuring the address follows P2WPKH format (bc1... for mainnet, tb1... for testnet). Store the generated address associated with the user's principal in stable storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Implement all necessary framework for functions",
          "Focus on address generation working"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a method to generate Bitcoin P2WPKH addresses",
        "Generated addresses are valid Segwit format (bc1... or tb1...)",
        "Addresses are persisted in stable storage linked to user principals",
        "Method handles both mainnet and testnet network contexts"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend framework for Bitcoin transaction signing. Add backend functionality to create and sign Bitcoin transactions using ECDSA with proper Segwit witness data structure. The signing process must handle P2WPKH inputs and generate valid transaction signatures without exposing private keys.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Implement all necessary framework for functions",
          "Troubleshoot back error implement all framework needed for targeted functions"
        ]
      },
      "acceptanceCriteria": [
        "Backend can construct raw Bitcoin transactions with proper input/output structure",
        "ECDSA signing produces valid signatures for Segwit transactions",
        "Witness data is correctly formatted for P2WPKH inputs",
        "Private keys remain secure and are never exposed in responses"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend framework for broadcasting signed Bitcoin transactions to the network. Add HTTP outcall functionality to broadcast signed transaction hex to multiple public Bitcoin API providers (blockchain.info, blockcypher.com). Track broadcast attempts and handle provider failures with fallback logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Implement all necessary framework for functions",
          "implement all framework needed for targeted functions"
        ]
      },
      "acceptanceCriteria": [
        "Backend makes HTTP outcalls to broadcast transaction hex to public APIs",
        "Multiple provider endpoints are attempted with fallback logic",
        "Broadcast success/failure is tracked per provider",
        "Transaction hash is returned on successful broadcast"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update frontend BitcoinAddressDisplay component to successfully fetch and display generated Bitcoin addresses from the backend. Ensure the component handles loading states, error states, and successfully renders the generated address with QR code and copy functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Focus on address generation working"
        ]
      },
      "acceptanceCriteria": [
        "Component successfully calls backend address generation method",
        "Loading state is shown while fetching address",
        "Generated address is displayed with QR code",
        "Copy-to-clipboard functionality works for the address",
        "Error states are handled gracefully with user feedback"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update frontend SendBtcPage to integrate with the new backend transaction signing and broadcasting framework. Connect the send form to backend methods that handle transaction construction, signing, and broadcasting. Display broadcast attempt logs and transaction status from the backend response.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Implement all necessary framework for functions"
        ]
      },
      "acceptanceCriteria": [
        "Send form successfully calls backend signing and broadcast methods",
        "Transaction signing status is displayed to the user",
        "Broadcast attempt logs from multiple providers are shown",
        "Transaction hash is displayed on successful broadcast",
        "Error handling shows specific failure reasons from backend"
      ]
    }
  ],
  "constraints": [
    "Use only Motoko for backend implementation",
    "All Bitcoin operations must use HTTP outcalls to public APIs",
    "Private keys must never be exposed in API responses or frontend code",
    "Maintain single-actor architecture in backend/main.mo",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts",
    "Use existing React Query patterns from frontend/src/hooks/useQueries.ts"
  ],
  "nonGoals": [
    "Integration with Bitcoin Core RPC (not accessible from Internet Computer)",
    "Private key management UI or user-facing key export",
    "Multi-signature wallet functionality",
    "Lightning Network integration",
    "Hardware wallet integration",
    "Real-time WebSocket connections for transaction monitoring"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}