{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Reserve Monitoring UI + Signed-in Copy Updates",
  "requirements": [
    {
      "id": "REQ-91",
      "summary": "Add an admin-only Reserve section on /admin that displays reserve status and allows admins to adjust tracked reserve with a required reason.",
      "acceptanceCriteria": [
        "Admins can see reserve BTC balance, outstanding credits, and coverage ratio on `/admin`.",
        "Admins can submit a reserve adjustment amount and a required reason; on success, the reserve status display updates.",
        "Non-admin users cannot access the reserve management UI (it should not render for them).",
        "All user-facing text in this section is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for reserve admin features: a query hook that calls backend getReserveStatus() and a mutation hook that calls backend manageReserve(...) and invalidates the reserve-status query on success/failure. Ensure errors are shown in clear English via existing toast patterns. (Use the selected \"authorization\" component patterns via existing admin checks as needed; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add a new \"Reserve\" section within the existing Admin dashboard UI. Display reserve BTC balance, outstanding issued credits, and coverage ratio (including an explicit English fallback such as \"Not available\" when coverageRatio is absent). Add an admin-only form to adjust tracked reserve with: adjustment type (deposit/withdraw/correction), amount, and required English reason; call the new mutation hook and refresh the displayed status after success. Guard the entire Reserve section so it does not render unless admin status is confirmed (use existing admin-gating patterns from the selected \"authorization\" component; verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Update signed-in dashboard copy to clearly explain BTC denomination, 1:1 reserve backing, and USD value fluctuation without changing theme.",
      "acceptanceCriteria": [
        "Dashboard (or another signed-in screen) includes English text that states: 1 credit = 1 BTC, credits are backed 1:1 by BTC held in reserve, and USD value fluctuates with market price.",
        "No existing copy contradicts the 1:1 reserve statement.",
        "No blue/purple theme changes are introduced as part of this request (copy-only change is acceptable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add an English informational copy block in the signed-in Dashboard view stating: \"1 credit = 1 BTC\", credits are backed 1:1 by BTC held in reserve, and the USD market value fluctuates with the Bitcoin market price. Review and adjust any nearby dashboard copy to ensure nothing contradicts the 1:1 reserve statement, while keeping styling/theme unchanged (copy-only change)."
        }
      ]
    }
  ]
}