{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix manual input balance update and input validation",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Display backend validation errors in ManualVerificationForm and InstantFundingForm when invalid inputs are submitted",
      "acceptanceCriteria": [
        "Backend validation errors are displayed in the form UI with clear error messages",
        "Form prevents submission during validation or processing",
        "Success feedback is shown only after backend confirms the purchase was recorded"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/verification/ManualVerificationForm.tsx",
          "operation": "modify",
          "description": "Update form to display backend validation errors from the useRecordBitcoinPurchase mutation. Show error messages for invalid transaction IDs (non-64-character hex strings) and invalid BTC amounts (negative, zero, or exceeding 8 decimal places). Add loading state during submission to prevent duplicate requests. Display success feedback only after backend confirmation."
        },
        {
          "path": "frontend/src/components/buybtc/InstantFundingForm.tsx",
          "operation": "modify",
          "description": "Update form to display backend validation errors from the useRecordBitcoinPurchase mutation. Show error messages for invalid transaction IDs and BTC amounts returned by the backend. Ensure the form is disabled during mutation processing. Clear error state on new submission attempts."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useRecordBitcoinPurchase mutation properly exposes backend error responses to consuming components. After successful mutation, invalidate the 'balance' query key to trigger immediate balance refresh, ensuring React Query cache reflects the updated balance instantly without page refresh."
        },
        {
          "path": "frontend/src/utils/errors.ts",
          "operation": "modify",
          "description": "Add error message normalization for backend validation errors related to Bitcoin purchase input validation. Handle error messages for invalid transaction IDs and BTC amounts, ensuring user-friendly error text is displayed in forms."
        }
      ]
    }
  ]
}