{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "ReserveBTC Wallet — Frontend UX/copy updates for on-chain send outcomes and reserve funding clarification",
  "requirements": [
    {
      "id": "REQ-105",
      "summary": "Clarify Admin Reserve Management copy to state reserve BTC can be funded externally (BitPay, MoonPay, MetaMask) without adding any provider integrations.",
      "acceptanceCriteria": [
        "Admin Reserve Management section includes clear English explanatory text stating that reserve BTC may be funded externally (e.g., “Reserve BTC can be funded via external providers such as BitPay, MoonPay, or MetaMask, then recorded here.”).",
        "No direct MetaMask/BitPay/MoonPay API integration is required for this change; it is strictly copy/UX clarification.",
        "All new/updated text in this area is English and consistent with existing tone."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update the Reserve Management section UI copy (e.g., CardDescription and/or an inline Alert under the section header) to explain that reserve BTC can be funded externally via providers such as BitPay, MoonPay, or MetaMask, then recorded/adjusted here; keep wording clear English and avoid adding any provider connection flows."
        }
      ]
    },
    {
      "id": "REQ-106",
      "summary": "Make Send BTC and Admin Send BTC flows clearly show request ID, txid (when available), failure reason (when FAILED), and an obvious path to open request details in History.",
      "acceptanceCriteria": [
        "After submitting Send BTC, the UI shows the created request ID and, when available, the on-chain txid pulled from the persisted `SendBTCRequest.blockchainTxId`.",
        "If a send fails (request status `FAILED`), the UI shows a clear English message that the transaction was not posted to the Bitcoin blockchain, includes the backend-provided failure reason when present, and indicates credits were restored.",
        "The UI provides an obvious action to view the request details (e.g., navigates to History and opens the request details) so users can troubleshoot why it did not appear on mainnet."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SendBtcPage.tsx",
          "operation": "modify",
          "description": "Refine the post-submit outcome alert messaging and labels to consistently communicate: (1) request ID always, (2) txid when `transferRequest.blockchainTxId` is present, (3) for `FAILED`, explicitly state it was not posted to the Bitcoin blockchain, show `failureReason` when available, and state credits were restored; ensure the existing CTA to open History details remains prominent."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Align the Admin 'Send BTC to Mainnet Wallet' outcome UI with the Send BTC page: after submit, display request ID; show txid when `SendBTCRequest.blockchainTxId` is present; if status is `FAILED`, show a clear English 'not posted to the Bitcoin blockchain' message including backend-provided `failureReason` when present and note credits were restored; include an obvious action that navigates to History and auto-opens the request details using the existing sessionStorage `openTransferRequestId` pattern."
        },
        {
          "path": "frontend/src/components/transfers/TransferHistoryTable.tsx",
          "operation": "modify",
          "description": "Make the History 'Details' affordance more explicit for troubleshooting failed/unknown mainnet posting (e.g., adjust button label and/or add a short helper text/tooltip for debit rows indicating it opens the transfer request details including status/txid/failure reason), without changing the underlying navigation behavior."
        }
      ]
    }
  ]
}