{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix username not persisting during profile creation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix ProfileSetupModal to ensure username persists when saving profile",
      "acceptanceCriteria": [
        "Username entered in ProfileSetupModal successfully persists to the backend",
        "Profile creation completes without errors",
        "User can proceed past the profile setup modal after entering a valid username",
        "Backend returns the created profile with the correct username"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Review and fix the profile save logic to ensure the username value from the input field is correctly passed to the saveCallerUserProfile mutation. Verify the mutation is being called with the correct profile structure matching the UserProfile type from backend.d.ts. Ensure the form submission handler prevents default behavior and properly awaits the mutation result before proceeding."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the saveCallerUserProfile mutation implementation to ensure it correctly calls actor.saveCallerUserProfile with the profile parameter. Verify the mutation invalidates the 'currentUserProfile' query key upon success to trigger a refetch. Add proper error handling to catch and expose backend errors to the UI component."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add comprehensive error handling and user feedback to ProfileSetupModal",
      "acceptanceCriteria": [
        "ProfileSetupModal displays error messages if profile creation fails",
        "User receives clear feedback about what went wrong",
        "Modal shows loading state while profile is being created",
        "User can retry profile creation if an error occurs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Add error state display by checking mutation.error and mutation.isError from the saveCallerUserProfile hook. Show a loading spinner or disabled state on the save button while mutation.isPending is true. Display user-friendly error messages extracted from mutation.error using appropriate error normalization. Ensure the form remains open on error to allow retry, and clears error state when user modifies input. Add validation feedback for empty username before submission."
        }
      ]
    }
  ]
}