{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement flexible Bitcoin address validation, AI-assisted broadcast troubleshooting, and on-chain confirmation tracking - Frontend",
  "requirements": [
    {
      "id": "REQ-182",
      "summary": "Display visual confirmation indicators for broadcasted and confirmed transfers in VerifyTransferDialog and TransferTroubleshootingPage",
      "acceptanceCriteria": [
        "A check mark or success icon appears when blockchainTxId is present",
        "An additional confirmation indicator appears when status is COMPLETED",
        "Transaction hash is displayed prominently and is copyable",
        "All user-facing text is in clear English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/transfers/VerifyTransferDialog.tsx",
          "operation": "modify",
          "description": "Add visual confirmation indicators to display a check mark or success icon when blockchainTxId is present in the transfer request, and show an additional confirmed/completed indicator when status is COMPLETED. Ensure the transaction hash is displayed prominently with copy-to-clipboard functionality. Update status badge styling to clearly differentiate between broadcasted (IN_PROGRESS with txid) and confirmed (COMPLETED) states using appropriate icons and colors."
        },
        {
          "path": "frontend/src/pages/TransferTroubleshootingPage.tsx",
          "operation": "modify",
          "description": "Add confirmation status indicators showing a check mark when the transfer has been broadcasted (blockchainTxId exists) and an additional confirmation badge when the status is COMPLETED. Display the blockchain transaction ID prominently with copy functionality. Update the UI to clearly communicate the difference between 'broadcasted to blockchain API' and 'confirmed on-chain' states using distinct visual indicators and English labels."
        }
      ]
    },
    {
      "id": "REQ-184",
      "summary": "Display real-time broadcast and troubleshooting status updates during AI-assisted broadcast attempts in Send BTC flows",
      "acceptanceCriteria": [
        "Real-time status messages appear during broadcast attempts",
        "Troubleshooting progress is communicated to the user in English",
        "Final outcome (success with txid or definitive failure) is clearly displayed",
        "User can view detailed diagnostics via the troubleshooting page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SendBtcPage.tsx",
          "operation": "modify",
          "description": "Add real-time status messaging during the sendBTC operation to display progress updates in clear English such as 'Attempting broadcast...', 'Broadcast failed, analyzing issue...', 'Retrying with adjusted parameters...', and 'Transaction posted to blockchain, awaiting confirmation...'. Implement polling or periodic status checks after submission to fetch updated transfer request status and diagnostic data from the backend. Display the current broadcast attempt status and any troubleshooting progress messages. On final success (txid received), show a success message with the transaction ID and a link to the troubleshooting page for detailed diagnostics. On definitive failure, display the failure reason clearly and provide a link to troubleshooting."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update the Admin Send BTC tab to display real-time broadcast and troubleshooting status updates while the AI-assisted broadcast loop is active in the backend. Show progress messages in clear English (e.g., 'Attempting broadcast...', 'Broadcast failed, analyzing issue...', 'Retrying with adjusted parameters...', 'Transaction posted to blockchain, awaiting confirmation...'). Implement status polling after initiating a transfer to fetch updated request status and diagnostic data. Display the final outcome prominently with either the blockchain transaction ID on success or a clear failure reason with link to troubleshooting."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook for polling transfer request status during active broadcast attempts, such as useTransferRequestStatus(requestId, { enabled, refetchInterval }). This hook should call the backend refreshTransferRequestStatus or getTransferRequest method periodically to fetch updated status, diagnosticData, and blockchainTxId. Ensure the hook can be enabled/disabled based on transfer state (e.g., only poll while status is PENDING or IN_PROGRESS) and stops polling once status reaches COMPLETED, FAILED, or EVICTED."
        }
      ]
    }
  ]
}