{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "USD estimates in transaction history + authenticated AI Lottery page",
  "requirements": [
    {
      "id": "REQ-146",
      "summary": "Show per-transaction estimated USD value lines in Transaction History using existing BTC/USD price query and existing disclosure copy.",
      "acceptanceCriteria": [
        "On `/history`, each transaction row (in `frontend/src/components/transfers/TransferHistoryTable.tsx`) shows the BTC-denominated amount and, directly beneath it, an estimated USD value line when BTC/USD price data is available.",
        "When BTC/USD price data is unavailable or still loading, the UI shows an English placeholder consistent with `frontend/src/components/balance/UsdEstimateLine.tsx` behavior (e.g., loading skeleton and/or “USD value unavailable”).",
        "The USD estimate copy includes the existing English disclosure that it is an estimate and can fluctuate (same wording as `UsdEstimateLine`).",
        "The implementation uses the existing `useGetCurrentBtcPriceUsd()` hook from `frontend/src/hooks/useQueries.ts` (no new price-fetching mechanism).",
        "User-facing text added/changed for this requirement is in clear English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/transfers/TransferHistoryTable.tsx",
          "operation": "modify",
          "description": "Integrate the existing price query via `useGetCurrentBtcPriceUsd()` and render `UsdEstimateLine` directly beneath each transaction’s BTC amount in the Amount column (including the existing English estimate disclosure and placeholder behavior). Ensure the primary amount is clearly BTC-denominated. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-147",
      "summary": "Add a new authenticated AI Lottery page with in-app Powerball-style outcome generation, robust draw-data fetch attempt, fallbacks, disclosures, routing, and navigation.",
      "acceptanceCriteria": [
        "A new route is added in `frontend/src/App.tsx` for the Lottery page (for example: `/ai-lottery`) and it is accessible to signed-in users under the existing `AuthGate` flow.",
        "The main app navigation is updated to include a link to the Lottery page (update `frontend/src/components/layout/AppHeader.tsx` nav links list).",
        "A new page component is created (e.g., `frontend/src/pages/AiLotteryPage.tsx`) that renders: (1) a page title, (2) a short English explanation of what the page does, (3) a primary action to generate outcomes (e.g., “Generate AI Spins”), and (4) a results area that displays 3 outcomes with: Spin number, 5 sorted main numbers (1–69), Powerball (1–26), and an “AI Confidence” percentage (70%–95%).",
        "The page attempts to fetch recent draw data from the user-provided URL `https://data.ny.gov` and uses the fetched data when possible; if the fetch fails or the data is not usable as expected, the UI must show a clear English error state and still allow the user to generate outcomes using a local fallback dataset/logic so the page remains usable.",
        "The UI includes an explicit English disclosure that lottery outcomes are for entertainment only, do not improve odds, and do not guarantee winnings.",
        "The UI includes an explicit English disclosure that the app is not running Python/scikit-learn code in the browser or backend, and that the displayed results are generated in-app using a simplified, Powerball-style randomization approach inspired by the provided pseudocode.",
        "All user-facing text added for this page is in clear English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AiLotteryPage.tsx",
          "operation": "create",
          "description": "Create the authenticated AI Lottery page UI (title, short English explanation, primary “Generate AI Spins” action, and results area for 3 outcomes). Implement in-app Powerball-style generation (5 unique sorted main numbers 1–69 + 1 Powerball 1–26 + AI Confidence 70–95) inspired by the provided pseudocode, with explicit English disclosures (entertainment-only; not running Python/scikit-learn/LLMs). Attempt to fetch recent draw data from `https://data.ny.gov`, use it when usable, and show a clear English error state while still enabling generation via a local fallback dataset/logic."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new `/ai-lottery` route into the TanStack Router route tree under the existing `AuthGate` (signed-in users only) flow. Use the existing authorization/authentication setup to keep the page authenticated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Add an “AI Lottery” navigation item that links to the new `/ai-lottery` route in both desktop and mobile navigation for authenticated users. Ensure it follows the existing authenticated navigation pattern. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}