{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T09:04:38.681Z",
  "summary": "The diff shows type-level additions in backend/main.mo around reserve status reporting, but it does not provide evidence of the required reserve-matching logic changes for credit issuance or send/broadcast enforcement. It also appears to introduce unrelated scope in project_state.json and includes an incorrect coverage ratio definition in comments/types.",
  "missing_requirements": [
    {
      "id": "REQ-152",
      "requirement": "Expose a single source of truth for reserve coverage where coverageRatio is computed as reserveBtcBalance / outstandingIssuedCredits and returned in a reserve-status response.",
      "reason": "The diff introduces a ReserveStatus type, but its documentation explicitly defines the ratio as outstandingIssuedCredits / reserveBtcBalance, which conflicts with the requirement’s example and intent (reserve coverage). No other implementation is shown to correct this.",
      "evidence": [
        "backend/main.mo (ReserveStatus comments: \"coverageRatio ... outstandingIssuedCredits / reserveBtcBalance\")"
      ]
    },
    {
      "id": "REQ-153",
      "requirement": "Fix verified credit purchase accounting so first purchase can mint credits even when reserveBtcBalance starts at 0, while ensuring reserveBtcBalance and outstandingIssuedCredits increase appropriately after purchase.",
      "reason": "The diff snippet contains only state/type declarations; it does not show any deposit verification or credit-minting logic changes that would adjust reserve tracking during purchase verification.",
      "evidence": [
        "backend/main.mo (truncated; no deposit verification / minting logic shown)"
      ]
    },
    {
      "id": "REQ-154",
      "requirement": "Enforce reserve-aware send/broadcast behavior by checking tracked reserve coverage for totalCost before creating/broadcasting a send request, decrementing reserve exactly once on success, and not decrementing on failed broadcasts where credits are restored.",
      "reason": "No code paths for creating/broadcasting Send BTC requests are shown in the diff excerpt; therefore there is no evidence of the required pre-checks and reserve accounting adjustments tied to broadcast outcomes.",
      "evidence": [
        "backend/main.mo (truncated; no send/broadcast logic shown)"
      ]
    },
    {
      "id": "REQ-155",
      "requirement": "Provide a backend query method that returns ReserveStatus including reserveBtcBalance, outstandingIssuedCredits, and coverageRatio, and does not mutate state.",
      "reason": "A ReserveStatus type is added, but the diff excerpt does not show any query method (e.g., getReserveStatus) that returns it, nor evidence that such a method is non-mutating.",
      "evidence": [
        "backend/main.mo (truncated; only type definitions shown)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Project scope expanded to include an \"AI-driven lottery page\" and displaying USD value beneath credits in transaction history.",
      "reason": "This is not requested in the BuildRequest and conflicts with the constraint/non-goals around avoiding AI/LLM-related functionality.",
      "evidence": [
        "project_state.json (\"summary\": \"... add an AI-driven lottery page ...\")"
      ]
    },
    {
      "description": "Added fields/types related to detached signed transactions and mempool/fee analysis (e.g., tempStorageForBTCTransaction, MempoolAnalysisResult, FeeRateSufficiency).",
      "reason": "These additions are not explicitly requested by REQ-152 through REQ-155, which focus on reserve accounting, reserve-aware send enforcement, and reserve status reporting.",
      "evidence": [
        "backend/main.mo (SendBTCRequest.tempStorageForBTCTransaction; MempoolAnalysisResult; FeeRateSufficiency; ConfirmationAnalysisResult.feeDecryptorAnalysis)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "project_state.json"
  ]
}