{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T04:07:46.386Z",
  "summary": "Frontend UX for Send BTC/History appears updated to surface request IDs, statuses, txids, failure messaging, and a details flow. Backend state shape was changed (added diagnosticData) with a migration. However, the diff summary is truncated for backend/main.mo and does not show the actual sendBTC broadcast logic, failure rollback semantics, or reserve accounting changes, so those backend requirements cannot be confirmed from the provided evidence. Admin Reserve Management copy about external funding sources is also not evidenced in the shown AdminPage excerpt.",
  "missing_requirements": [
    {
      "id": "REQ-101",
      "requirement": "Fix backend on-chain broadcast so Send BTC withdrawals are posted to Bitcoin mainnet via existing IC HTTP outcalls path and persist txid on success.",
      "reason": "backend/main.mo changes are truncated and do not show sendBTC implementation or any replacement of BTC_API_DISABLED with a real OutCall-based broadcast, nor the persistence update of blockchainTxId on success.",
      "evidence": [
        "backend/main.mo (truncated; shows OutCall import and type additions but not sendBTC logic)"
      ]
    },
    {
      "id": "REQ-102",
      "requirement": "On broadcast failure, mark request FAILED, store English failureReason, and restore deducted credits (totalCost) while keeping the request record retrievable.",
      "reason": "The diff shows failureReason fields/types and UI messaging, but does not show backend logic that (a) updates status to FAILED, (b) sets failureReason, and (c) restores caller balance/credits on broadcast failure.",
      "evidence": [
        "backend/main.mo (truncated; SendBTCRequest type includes failureReason but no failure handling logic shown)"
      ]
    },
    {
      "id": "REQ-103",
      "requirement": "Reserve accounting should not decrement on failed broadcasts and should decrement only on successful on-chain outcomes.",
      "reason": "No reserve accounting logic changes related to successful vs failed broadcasts are visible in the diff summary; only type/state definitions are shown.",
      "evidence": [
        "backend/main.mo (truncated; reserveBtcBalance var shown, but no corresponding send/reserve update logic shown)"
      ]
    },
    {
      "id": "REQ-104",
      "requirement": "Add backend-side diagnostics for broadcast failures without leaking secrets; store a structured/English failure reason retrievable via getTransferRequest.",
      "reason": "A new diagnosticData field/type is added and migration sets it to null, but the diff summary does not show backend code that populates diagnosticData/failureReason from actual broadcast attempt errors, nor any admin/dev-only gating semantics.",
      "evidence": [
        "backend/main.mo (truncated; SendBTCRequest adds diagnosticData and BroadcastResponse adds diagnosticData but no usage shown)",
        "backend/migration.mo (adds diagnosticData field with null default)"
      ]
    },
    {
      "id": "REQ-105",
      "requirement": "Update Admin Reserve Management UX copy to state reserve BTC can be funded externally (BitPay, MoonPay, MetaMask) without implementing integrations.",
      "reason": "AdminPage is truncated and the provided excerpt does not show the reserve management explanatory copy requested; no other shown diff section contains the specified text.",
      "evidence": [
        "frontend/src/pages/AdminPage.tsx (truncated; reserve management state present but no external-funding copy shown)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added general-purpose URL/sessionStorage parameter utilities (getUrlParameter, getPersistedUrlParameter, clearSessionParameter, etc.).",
      "reason": "Not requested by any listed requirements (REQ-101 through REQ-106) which focus on BTC broadcast reliability, diagnostics, reserve accounting, and specific UX copy/transfer outcome visibility.",
      "evidence": [
        "frontend/src/utils/urlParams.ts"
      ]
    }
  ],
  "confidence": 0.56,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/transfers/TransferHistoryTable.tsx",
    "frontend/src/components/transfers/VerifyTransferDialog.tsx",
    "frontend/src/pages/AdminPage.tsx",
    "frontend/src/pages/SendBtcPage.tsx",
    "frontend/src/utils/urlParams.ts",
    "project_state.json"
  ]
}