{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T03:08:49.016Z",
  "summary": "Frontend changes clearly add 1:1 BTC backing copy on the Dashboard and introduce an admin Reserve Management UI section/hooks. Backend diff evidence shows new reserve-related state/types, but the truncated backend snippet does not show the required reserve query, lifecycle accounting updates, enforcement, or auditable reserve-adjustment history being implemented/queryable.",
  "missing_requirements": [
    {
      "id": "REQ-88",
      "requirement": "Expose a backend query that returns reserve status including: reserve BTC balance, total outstanding issued credits, and a reserve coverage ratio computed from backend state.",
      "reason": "The backend diff snippet shows new state/types (e.g., `reserveBtcBalance`, `outstandingIssuedCredits`, `ReserveStatus`) but does not show a public query method that returns these fields, nor evidence that outstanding credits are computed deterministically from backend state within that query.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-89",
      "requirement": "Automatically update reserve status during credit lifecycle events (increase reserve on verified purchase issuance; decrease reserve on broadcast-successful send by amount+networkFee; do not decrement reserve on broadcast failure; ensure no double-counting).",
      "reason": "The diff snippet does not show any modifications to the credit purchase verification/issuance flow or the on-chain broadcast flow that adjust `reserveBtcBalance` according to the specified rules, nor any idempotency/deduplication mechanism for retries.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-90",
      "requirement": "Enforce 1:1 reserve backing by preventing issuance when outstanding credits would exceed tracked reserve unless an admin override exists; add an admin-only reserve adjustment method with required English reason and auditable, queryable history.",
      "reason": "The backend snippet includes reserve-related types (e.g., `ReserveAdjustment`, `ReserveChangeReason`) but does not show (a) issuance-time enforcement that fails with a clear English message, (b) an admin-only method to adjust reserve with a reason string, or (c) a queryable audit log/history of reserve adjustments.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added URL/session parameter persistence utilities (including sensitive-parameter handling via hash/query parsing and sessionStorage persistence) that are unrelated to the reserve backing + admin reserve monitoring requirements.",
      "reason": "BuildRequest does not request URL parameter/session persistence utilities; this appears to be additional functionality beyond the specified reserve model/admin monitoring/copy updates.",
      "evidence": [
        "frontend/src/utils/urlParams.ts"
      ]
    }
  ],
  "confidence": 0.55,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/AdminPage.tsx",
    "frontend/src/pages/DashboardPage.tsx",
    "frontend/src/utils/urlParams.ts",
    "project_state.json"
  ]
}